zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxn/pinctrl/MCXN947VDF-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXN947VDF/signal_configuration.xml
 *
 * 
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXN947VDF_
#define _ZEPHYR_DTS_BINDING_MCXN947VDF_

#define N9X_MUX(port, pin, mux)		\
	(((((port) - '0') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0xF) << 8))

#define PIO0_0 N9X_MUX('0',0,0) /* PT0_0 */
#define TMS_PIO0_0 N9X_MUX('0',0,1) /* PT0_0 */
#define SWDIO_PIO0_0 N9X_MUX('0',0,1) /* PT0_0 */
#define FC1_P0_PIO0_0 N9X_MUX('0',0,2) /* PT0_0 */
#define CT_INP0_PIO0_0 N9X_MUX('0',0,4) /* PT0_0 */
#define PIO0_1 N9X_MUX('0',1,0) /* PT0_1 */
#define TCLK_PIO0_1 N9X_MUX('0',1,1) /* PT0_1 */
#define SWCLK_PIO0_1 N9X_MUX('0',1,1) /* PT0_1 */
#define FC1_P1_PIO0_1 N9X_MUX('0',1,2) /* PT0_1 */
#define CT_INP1_PIO0_1 N9X_MUX('0',1,4) /* PT0_1 */
#define PIO0_2 N9X_MUX('0',2,0) /* PT0_2 */
#define SWO_PIO0_2 N9X_MUX('0',2,1) /* PT0_2 */
#define TDO_PIO0_2 N9X_MUX('0',2,1) /* PT0_2 */
#define FC1_P2_PIO0_2 N9X_MUX('0',2,2) /* PT0_2 */
#define CT0_MAT0_PIO0_2 N9X_MUX('0',2,4) /* PT0_2 */
#define UTICK_CAP0_PIO0_2 N9X_MUX('0',2,5) /* PT0_2 */
#define I3C0_PUR_PIO0_2 N9X_MUX('0',2,10) /* PT0_2 */
#define PIO0_3 N9X_MUX('0',3,0) /* PT0_3 */
#define CMP1_IN1_PIO0_3 N9X_MUX('0',3,0) /* PT0_3 */
#define TDI_PIO0_3 N9X_MUX('0',3,1) /* PT0_3 */
#define FC1_P3_PIO0_3 N9X_MUX('0',3,2) /* PT0_3 */
#define CT0_MAT1_PIO0_3 N9X_MUX('0',3,4) /* PT0_3 */
#define UTICK_CAP1_PIO0_3 N9X_MUX('0',3,5) /* PT0_3 */
#define HSCMP0_OUT_PIO0_3 N9X_MUX('0',3,8) /* PT0_3 */
#define PIO0_4 N9X_MUX('0',4,0) /* PT0_4 */
#define TSI0_CH8_PIO0_4 N9X_MUX('0',4,0) /* PT0_4 */
#define WUU0_IN0_PIO0_4 N9X_MUX('0',4,0) /* PT0_4 */
#define EWM0_IN_PIO0_4 N9X_MUX('0',4,1) /* PT0_4 */
#define FC0_P0_PIO0_4 N9X_MUX('0',4,2) /* PT0_4 */
#define FC1_P4_PIO0_4 N9X_MUX('0',4,3) /* PT0_4 */
#define CT0_MAT2_PIO0_4 N9X_MUX('0',4,4) /* PT0_4 */
#define UTICK_CAP2_PIO0_4 N9X_MUX('0',4,5) /* PT0_4 */
#define HSCMP1_OUT_PIO0_4 N9X_MUX('0',4,8) /* PT0_4 */
#define PDM0_CLK_PIO0_4 N9X_MUX('0',4,9) /* PT0_4 */
#define PIO0_5 N9X_MUX('0',5,0) /* PT0_5 */
#define TSI0_CH9_PIO0_5 N9X_MUX('0',5,0) /* PT0_5 */
#define EWM0_OUT_b_PIO0_5 N9X_MUX('0',5,1) /* PT0_5 */
#define FC0_P1_PIO0_5 N9X_MUX('0',5,2) /* PT0_5 */
#define FC1_P5_PIO0_5 N9X_MUX('0',5,3) /* PT0_5 */
#define CT0_MAT3_PIO0_5 N9X_MUX('0',5,4) /* PT0_5 */
#define UTICK_CAP3_PIO0_5 N9X_MUX('0',5,5) /* PT0_5 */
#define PDM0_DATA0_PIO0_5 N9X_MUX('0',5,9) /* PT0_5 */
#define PIO0_6 N9X_MUX('0',6,0) /* PT0_6 */
#define TSI0_CH10_PIO0_6 N9X_MUX('0',6,0) /* PT0_6 */
#define ISPMODE_N_PIO0_6 N9X_MUX('0',6,1) /* PT0_6 */
#define FC0_P2_PIO0_6 N9X_MUX('0',6,2) /* PT0_6 */
#define FC1_P6_PIO0_6 N9X_MUX('0',6,3) /* PT0_6 */
#define CT_INP2_PIO0_6 N9X_MUX('0',6,4) /* PT0_6 */
#define HSCMP2_OUT_PIO0_6 N9X_MUX('0',6,8) /* PT0_6 */
#define PDM0_DATA1_PIO0_6 N9X_MUX('0',6,9) /* PT0_6 */
#define PIO0_7 N9X_MUX('0',7,0) /* PT0_7 */
#define WUU0_IN1_PIO0_7 N9X_MUX('0',7,0) /* PT0_7 */
#define CMP2_IN1_PIO0_7 N9X_MUX('0',7,0) /* PT0_7 */
#define FC0_P3_PIO0_7 N9X_MUX('0',7,2) /* PT0_7 */
#define CT_INP3_PIO0_7 N9X_MUX('0',7,4) /* PT0_7 */
#define PIO0_8 N9X_MUX('0',8,0) /* PT0_8 */
#define ADC0_B8_PIO0_8 N9X_MUX('0',8,0) /* PT0_8 */
#define FC0_P4_PIO0_8 N9X_MUX('0',8,2) /* PT0_8 */
#define CT_INP0_PIO0_8 N9X_MUX('0',8,4) /* PT0_8 */
#define FLEXIO0_D0_PIO0_8 N9X_MUX('0',8,6) /* PT0_8 */
#define PIO0_9 N9X_MUX('0',9,0) /* PT0_9 */
#define ADC0_B9_PIO0_9 N9X_MUX('0',9,0) /* PT0_9 */
#define FC0_P5_PIO0_9 N9X_MUX('0',9,2) /* PT0_9 */
#define CT_INP1_PIO0_9 N9X_MUX('0',9,4) /* PT0_9 */
#define FLEXIO0_D1_PIO0_9 N9X_MUX('0',9,6) /* PT0_9 */
#define PIO0_10 N9X_MUX('0',10,0) /* PT0_10 */
#define ADC0_B10_PIO0_10 N9X_MUX('0',10,0) /* PT0_10 */
#define FC0_P6_PIO0_10 N9X_MUX('0',10,2) /* PT0_10 */
#define CT0_MAT0_PIO0_10 N9X_MUX('0',10,4) /* PT0_10 */
#define FLEXIO0_D2_PIO0_10 N9X_MUX('0',10,6) /* PT0_10 */
#define PIO0_11 N9X_MUX('0',11,0) /* PT0_11 */
#define ADC0_B11_PIO0_11 N9X_MUX('0',11,0) /* PT0_11 */
#define CT0_MAT1_PIO0_11 N9X_MUX('0',11,4) /* PT0_11 */
#define FLEXIO0_D3_PIO0_11 N9X_MUX('0',11,6) /* PT0_11 */
#define HSCMP2_OUT_PIO0_11 N9X_MUX('0',11,8) /* PT0_11 */
#define PIO0_12 N9X_MUX('0',12,0) /* PT0_12 */
#define ADC0_B12_PIO0_12 N9X_MUX('0',12,0) /* PT0_12 */
#define FC1_P4_PIO0_12 N9X_MUX('0',12,2) /* PT0_12 */
#define FC0_P0_PIO0_12 N9X_MUX('0',12,3) /* PT0_12 */
#define CT0_MAT2_PIO0_12 N9X_MUX('0',12,4) /* PT0_12 */
#define FLEXIO0_D4_PIO0_12 N9X_MUX('0',12,6) /* PT0_12 */
#define PIO0_13 N9X_MUX('0',13,0) /* PT0_13 */
#define ADC0_B13_PIO0_13 N9X_MUX('0',13,0) /* PT0_13 */
#define FC1_P5_PIO0_13 N9X_MUX('0',13,2) /* PT0_13 */
#define FC0_P1_PIO0_13 N9X_MUX('0',13,3) /* PT0_13 */
#define CT0_MAT3_PIO0_13 N9X_MUX('0',13,4) /* PT0_13 */
#define FLEXIO0_D5_PIO0_13 N9X_MUX('0',13,6) /* PT0_13 */
#define PIO0_14 N9X_MUX('0',14,0) /* PT0_14 */
#define ADC0_B14_PIO0_14 N9X_MUX('0',14,0) /* PT0_14 */
#define FC1_P6_PIO0_14 N9X_MUX('0',14,2) /* PT0_14 */
#define FC0_P2_PIO0_14 N9X_MUX('0',14,3) /* PT0_14 */
#define CT_INP2_PIO0_14 N9X_MUX('0',14,4) /* PT0_14 */
#define UTICK_CAP0_PIO0_14 N9X_MUX('0',14,5) /* PT0_14 */
#define FLEXIO0_D6_PIO0_14 N9X_MUX('0',14,6) /* PT0_14 */
#define ADC0_B15_PIO0_15 N9X_MUX('0',15,0) /* PT0_15 */
#define PIO0_15 N9X_MUX('0',15,0) /* PT0_15 */
#define FC0_P3_PIO0_15 N9X_MUX('0',15,3) /* PT0_15 */
#define CT_INP3_PIO0_15 N9X_MUX('0',15,4) /* PT0_15 */
#define UTICK_CAP1_PIO0_15 N9X_MUX('0',15,5) /* PT0_15 */
#define FLEXIO0_D7_PIO0_15 N9X_MUX('0',15,6) /* PT0_15 */
#define PIO0_16 N9X_MUX('0',16,0) /* PT0_16 */
#define ADC0_A8_PIO0_16 N9X_MUX('0',16,0) /* PT0_16 */
#define WUU0_IN2_PIO0_16 N9X_MUX('0',16,0) /* PT0_16 */
#define TSI0_CH11_PIO0_16 N9X_MUX('0',16,0) /* PT0_16 */
#define FC0_P0_PIO0_16 N9X_MUX('0',16,2) /* PT0_16 */
#define CT0_MAT0_PIO0_16 N9X_MUX('0',16,4) /* PT0_16 */
#define UTICK_CAP2_PIO0_16 N9X_MUX('0',16,5) /* PT0_16 */
#define FLEXIO0_D0_PIO0_16 N9X_MUX('0',16,6) /* PT0_16 */
#define PDM0_CLK_PIO0_16 N9X_MUX('0',16,9) /* PT0_16 */
#define I3C0_SDA_PIO0_16 N9X_MUX('0',16,10) /* PT0_16 */
#define PIO0_17 N9X_MUX('0',17,0) /* PT0_17 */
#define ADC0_A9_PIO0_17 N9X_MUX('0',17,0) /* PT0_17 */
#define TSI0_CH12_PIO0_17 N9X_MUX('0',17,0) /* PT0_17 */
#define FC0_P1_PIO0_17 N9X_MUX('0',17,2) /* PT0_17 */
#define CT0_MAT1_PIO0_17 N9X_MUX('0',17,4) /* PT0_17 */
#define UTICK_CAP3_PIO0_17 N9X_MUX('0',17,5) /* PT0_17 */
#define FLEXIO0_D1_PIO0_17 N9X_MUX('0',17,6) /* PT0_17 */
#define PDM0_DATA0_PIO0_17 N9X_MUX('0',17,9) /* PT0_17 */
#define I3C0_SCL_PIO0_17 N9X_MUX('0',17,10) /* PT0_17 */
#define PIO0_18 N9X_MUX('0',18,0) /* PT0_18 */
#define ADC0_A10_PIO0_18 N9X_MUX('0',18,0) /* PT0_18 */
#define TSI0_CH13_PIO0_18 N9X_MUX('0',18,0) /* PT0_18 */
#define EWM0_IN_PIO0_18 N9X_MUX('0',18,1) /* PT0_18 */
#define FC0_P2_PIO0_18 N9X_MUX('0',18,2) /* PT0_18 */
#define CT0_MAT2_PIO0_18 N9X_MUX('0',18,4) /* PT0_18 */
#define FLEXIO0_D2_PIO0_18 N9X_MUX('0',18,6) /* PT0_18 */
#define HSCMP0_OUT_PIO0_18 N9X_MUX('0',18,8) /* PT0_18 */
#define PDM0_DATA1_PIO0_18 N9X_MUX('0',18,9) /* PT0_18 */
#define PIO0_19 N9X_MUX('0',19,0) /* PT0_19 */
#define TSI0_CH14_PIO0_19 N9X_MUX('0',19,0) /* PT0_19 */
#define ADC0_A11_PIO0_19 N9X_MUX('0',19,0) /* PT0_19 */
#define WUU0_IN3_PIO0_19 N9X_MUX('0',19,0) /* PT0_19 */
#define EWM0_OUT_b_PIO0_19 N9X_MUX('0',19,1) /* PT0_19 */
#define FC0_P3_PIO0_19 N9X_MUX('0',19,2) /* PT0_19 */
#define CT0_MAT3_PIO0_19 N9X_MUX('0',19,4) /* PT0_19 */
#define FLEXIO0_D3_PIO0_19 N9X_MUX('0',19,6) /* PT0_19 */
#define HSCMP1_OUT_PIO0_19 N9X_MUX('0',19,8) /* PT0_19 */
#define PIO0_20 N9X_MUX('0',20,0) /* PT0_20 */
#define WUU0_IN4_PIO0_20 N9X_MUX('0',20,0) /* PT0_20 */
#define TSI0_CH15_PIO0_20 N9X_MUX('0',20,0) /* PT0_20 */
#define ADC0_A12_PIO0_20 N9X_MUX('0',20,0) /* PT0_20 */
#define FC0_P4_PIO0_20 N9X_MUX('0',20,2) /* PT0_20 */
#define FC1_P0_PIO0_20 N9X_MUX('0',20,3) /* PT0_20 */
#define CT_INP0_PIO0_20 N9X_MUX('0',20,4) /* PT0_20 */
#define FLEXIO0_D4_PIO0_20 N9X_MUX('0',20,6) /* PT0_20 */
#define I3C0_SDA_PIO0_20 N9X_MUX('0',20,10) /* PT0_20 */
#define PIO0_21 N9X_MUX('0',21,0) /* PT0_21 */
#define ADC0_A13_PIO0_21 N9X_MUX('0',21,0) /* PT0_21 */
#define TSI0_CH16_PIO0_21 N9X_MUX('0',21,0) /* PT0_21 */
#define FC0_P5_PIO0_21 N9X_MUX('0',21,2) /* PT0_21 */
#define FC1_P1_PIO0_21 N9X_MUX('0',21,3) /* PT0_21 */
#define CT_INP1_PIO0_21 N9X_MUX('0',21,4) /* PT0_21 */
#define FLEXIO0_D5_PIO0_21 N9X_MUX('0',21,6) /* PT0_21 */
#define I3C0_SCL_PIO0_21 N9X_MUX('0',21,10) /* PT0_21 */
#define PIO0_22 N9X_MUX('0',22,0) /* PT0_22 */
#define ADC0_A14_PIO0_22 N9X_MUX('0',22,0) /* PT0_22 */
#define CMP1_IN2_PIO0_22 N9X_MUX('0',22,0) /* PT0_22 */
#define EWM0_IN_PIO0_22 N9X_MUX('0',22,1) /* PT0_22 */
#define FC0_P6_PIO0_22 N9X_MUX('0',22,2) /* PT0_22 */
#define FC1_P2_PIO0_22 N9X_MUX('0',22,3) /* PT0_22 */
#define CT_INP2_PIO0_22 N9X_MUX('0',22,4) /* PT0_22 */
#define FLEXIO0_D6_PIO0_22 N9X_MUX('0',22,6) /* PT0_22 */
#define I3C0_PUR_PIO0_22 N9X_MUX('0',22,10) /* PT0_22 */
#define PIO0_23 N9X_MUX('0',23,0) /* PT0_23 */
#define ADC0_A15_PIO0_23 N9X_MUX('0',23,0) /* PT0_23 */
#define CMP2_IN2_PIO0_23 N9X_MUX('0',23,0) /* PT0_23 */
#define WUU0_IN5_PIO0_23 N9X_MUX('0',23,0) /* PT0_23 */
#define EWM0_OUT_b_PIO0_23 N9X_MUX('0',23,1) /* PT0_23 */
#define FC1_P3_PIO0_23 N9X_MUX('0',23,3) /* PT0_23 */
#define CT_INP3_PIO0_23 N9X_MUX('0',23,4) /* PT0_23 */
#define FLEXIO0_D7_PIO0_23 N9X_MUX('0',23,6) /* PT0_23 */
#define PIO0_24 N9X_MUX('0',24,0) /* PT0_24 */
#define ADC0_B16_PIO0_24 N9X_MUX('0',24,0) /* PT0_24 */
#define FC1_P0_PIO0_24 N9X_MUX('0',24,2) /* PT0_24 */
#define CT0_MAT0_PIO0_24 N9X_MUX('0',24,4) /* PT0_24 */
#define PIO0_25 N9X_MUX('0',25,0) /* PT0_25 */
#define ADC0_B17_PIO0_25 N9X_MUX('0',25,0) /* PT0_25 */
#define FC1_P1_PIO0_25 N9X_MUX('0',25,2) /* PT0_25 */
#define CT0_MAT1_PIO0_25 N9X_MUX('0',25,4) /* PT0_25 */
#define PIO0_26 N9X_MUX('0',26,0) /* PT0_26 */
#define ADC0_B18_PIO0_26 N9X_MUX('0',26,0) /* PT0_26 */
#define FC1_P2_PIO0_26 N9X_MUX('0',26,2) /* PT0_26 */
#define CT0_MAT2_PIO0_26 N9X_MUX('0',26,4) /* PT0_26 */
#define PIO0_27 N9X_MUX('0',27,0) /* PT0_27 */
#define ADC0_B19_PIO0_27 N9X_MUX('0',27,0) /* PT0_27 */
#define FC1_P3_PIO0_27 N9X_MUX('0',27,2) /* PT0_27 */
#define CT0_MAT3_PIO0_27 N9X_MUX('0',27,4) /* PT0_27 */
#define PIO0_28 N9X_MUX('0',28,0) /* PT0_28 */
#define ADC0_B20_PIO0_28 N9X_MUX('0',28,0) /* PT0_28 */
#define FC1_P4_PIO0_28 N9X_MUX('0',28,2) /* PT0_28 */
#define FC0_P4_PIO0_28 N9X_MUX('0',28,3) /* PT0_28 */
#define CT_INP0_PIO0_28 N9X_MUX('0',28,4) /* PT0_28 */
#define PIO0_29 N9X_MUX('0',29,0) /* PT0_29 */
#define ADC0_B21_PIO0_29 N9X_MUX('0',29,0) /* PT0_29 */
#define FC1_P5_PIO0_29 N9X_MUX('0',29,2) /* PT0_29 */
#define FC0_P5_PIO0_29 N9X_MUX('0',29,3) /* PT0_29 */
#define CT_INP1_PIO0_29 N9X_MUX('0',29,4) /* PT0_29 */
#define PIO0_30 N9X_MUX('0',30,0) /* PT0_30 */
#define ADC0_B22_PIO0_30 N9X_MUX('0',30,0) /* PT0_30 */
#define FC1_P6_PIO0_30 N9X_MUX('0',30,2) /* PT0_30 */
#define FC0_P6_PIO0_30 N9X_MUX('0',30,3) /* PT0_30 */
#define CT_INP2_PIO0_30 N9X_MUX('0',30,4) /* PT0_30 */
#define PIO0_31 N9X_MUX('0',31,0) /* PT0_31 */
#define ADC0_B23_PIO0_31 N9X_MUX('0',31,0) /* PT0_31 */
#define CT_INP3_PIO0_31 N9X_MUX('0',31,4) /* PT0_31 */
#define PIO1_0 N9X_MUX('1',0,0) /* PT1_0 */
#define WUU0_IN6_PIO1_0 N9X_MUX('1',0,0) /* PT1_0 */
#define ADC0_A16_PIO1_0 N9X_MUX('1',0,0) /* PT1_0 */
#define CMP0_IN0_PIO1_0 N9X_MUX('1',0,0) /* PT1_0 */
#define TSI0_CH0_PIO1_0 N9X_MUX('1',0,0) /* PT1_0 */
#define TRIG_IN0_PIO1_0 N9X_MUX('1',0,1) /* PT1_0 */
#define FC3_P0_PIO1_0 N9X_MUX('1',0,2) /* PT1_0 */
#define FC4_P4_PIO1_0 N9X_MUX('1',0,3) /* PT1_0 */
#define CT_INP4_PIO1_0 N9X_MUX('1',0,4) /* PT1_0 */
#define SCT0_OUT6_PIO1_0 N9X_MUX('1',0,5) /* PT1_0 */
#define FLEXIO0_D8_PIO1_0 N9X_MUX('1',0,6) /* PT1_0 */
#define SAI1_TX_BCLK_PIO1_0 N9X_MUX('1',0,10) /* PT1_0 */
#define ADC0_A17_PIO1_1 N9X_MUX('1',1,0) /* PT1_1 */
#define PIO1_1 N9X_MUX('1',1,0) /* PT1_1 */
#define TSI0_CH1_PIO1_1 N9X_MUX('1',1,0) /* PT1_1 */
#define CMP1_IN0_PIO1_1 N9X_MUX('1',1,0) /* PT1_1 */
#define TRIG_IN1_PIO1_1 N9X_MUX('1',1,1) /* PT1_1 */
#define FC3_P1_PIO1_1 N9X_MUX('1',1,2) /* PT1_1 */
#define FC4_P5_PIO1_1 N9X_MUX('1',1,3) /* PT1_1 */
#define CT_INP5_PIO1_1 N9X_MUX('1',1,4) /* PT1_1 */
#define SCT0_OUT7_PIO1_1 N9X_MUX('1',1,5) /* PT1_1 */
#define FLEXIO0_D9_PIO1_1 N9X_MUX('1',1,6) /* PT1_1 */
#define SAI1_TX_FS_PIO1_1 N9X_MUX('1',1,10) /* PT1_1 */
#define PIO1_2 N9X_MUX('1',2,0) /* PT1_2 */
#define CMP2_IN0_PIO1_2 N9X_MUX('1',2,0) /* PT1_2 */
#define TSI0_CH2_PIO1_2 N9X_MUX('1',2,0) /* PT1_2 */
#define ADC0_A18_PIO1_2 N9X_MUX('1',2,0) /* PT1_2 */
#define TRIG_OUT0_PIO1_2 N9X_MUX('1',2,1) /* PT1_2 */
#define FC3_P2_PIO1_2 N9X_MUX('1',2,2) /* PT1_2 */
#define FC4_P6_PIO1_2 N9X_MUX('1',2,3) /* PT1_2 */
#define CT1_MAT0_PIO1_2 N9X_MUX('1',2,4) /* PT1_2 */
#define SCT0_IN6_PIO1_2 N9X_MUX('1',2,5) /* PT1_2 */
#define FLEXIO0_D10_PIO1_2 N9X_MUX('1',2,6) /* PT1_2 */
#define ENET0_MDC_PIO1_2 N9X_MUX('1',2,9) /* PT1_2 */
#define SAI1_TXD0_PIO1_2 N9X_MUX('1',2,10) /* PT1_2 */
#define CAN0_TXD_PIO1_2 N9X_MUX('1',2,11) /* PT1_2 */
#define PIO1_3 N9X_MUX('1',3,0) /* PT1_3 */
#define WUU0_IN7_PIO1_3 N9X_MUX('1',3,0) /* PT1_3 */
#define CMP0_IN1_PIO1_3 N9X_MUX('1',3,0) /* PT1_3 */
#define ADC0_A19_PIO1_3 N9X_MUX('1',3,0) /* PT1_3 */
#define TSI0_CH3_PIO1_3 N9X_MUX('1',3,0) /* PT1_3 */
#define TRIG_OUT1_PIO1_3 N9X_MUX('1',3,1) /* PT1_3 */
#define FC3_P3_PIO1_3 N9X_MUX('1',3,2) /* PT1_3 */
#define CT1_MAT1_PIO1_3 N9X_MUX('1',3,4) /* PT1_3 */
#define SCT0_IN7_PIO1_3 N9X_MUX('1',3,5) /* PT1_3 */
#define FLEXIO0_D11_PIO1_3 N9X_MUX('1',3,6) /* PT1_3 */
#define ENET0_MDIO_PIO1_3 N9X_MUX('1',3,9) /* PT1_3 */
#define SAI1_RXD0_PIO1_3 N9X_MUX('1',3,10) /* PT1_3 */
#define CAN0_RXD_PIO1_3 N9X_MUX('1',3,11) /* PT1_3 */
#define ADC0_A20_PIO1_4 N9X_MUX('1',4,0) /* PT1_4 */
#define TSI0_CH4_PIO1_4 N9X_MUX('1',4,0) /* PT1_4 */
#define PIO1_4 N9X_MUX('1',4,0) /* PT1_4 */
#define CMP0_IN2_PIO1_4 N9X_MUX('1',4,0) /* PT1_4 */
#define WUU0_IN8_PIO1_4 N9X_MUX('1',4,0) /* PT1_4 */
#define FREQME_CLK_IN0_PIO1_4 N9X_MUX('1',4,1) /* PT1_4 */
#define FC3_P4_PIO1_4 N9X_MUX('1',4,2) /* PT1_4 */
#define FC5_P0_PIO1_4 N9X_MUX('1',4,3) /* PT1_4 */
#define CT1_MAT2_PIO1_4 N9X_MUX('1',4,4) /* PT1_4 */
#define SCT0_OUT0_PIO1_4 N9X_MUX('1',4,5) /* PT1_4 */
#define FLEXIO0_D12_PIO1_4 N9X_MUX('1',4,6) /* PT1_4 */
#define SMARTDMA_PIO0_PIO1_4 N9X_MUX('1',4,7) /* PT1_4 */
#define ENET0_TX_CLK_PIO1_4 N9X_MUX('1',4,9) /* PT1_4 */
#define SAI0_TXD1_PIO1_4 N9X_MUX('1',4,10) /* PT1_4 */
#define TSI0_CH5_PIO1_5 N9X_MUX('1',5,0) /* PT1_5 */
#define PIO1_5 N9X_MUX('1',5,0) /* PT1_5 */
#define CMP0_IN3_PIO1_5 N9X_MUX('1',5,0) /* PT1_5 */
#define ADC0_A21_PIO1_5 N9X_MUX('1',5,0) /* PT1_5 */
#define FREQME_CLK_IN1_PIO1_5 N9X_MUX('1',5,1) /* PT1_5 */
#define FC3_P5_PIO1_5 N9X_MUX('1',5,2) /* PT1_5 */
#define FC5_P1_PIO1_5 N9X_MUX('1',5,3) /* PT1_5 */
#define CT1_MAT3_PIO1_5 N9X_MUX('1',5,4) /* PT1_5 */
#define SCT0_OUT1_PIO1_5 N9X_MUX('1',5,5) /* PT1_5 */
#define FLEXIO0_D13_PIO1_5 N9X_MUX('1',5,6) /* PT1_5 */
#define SMARTDMA_PIO1_PIO1_5 N9X_MUX('1',5,7) /* PT1_5 */
#define ENET0_TXEN_PIO1_5 N9X_MUX('1',5,9) /* PT1_5 */
#define SAI0_RXD1_PIO1_5 N9X_MUX('1',5,10) /* PT1_5 */
#define PIO1_6 N9X_MUX('1',6,0) /* PT1_6 */
#define TSI0_CH6_PIO1_6 N9X_MUX('1',6,0) /* PT1_6 */
#define ADC0_A22_PIO1_6 N9X_MUX('1',6,0) /* PT1_6 */
#define TRIG_IN2_PIO1_6 N9X_MUX('1',6,1) /* PT1_6 */
#define FC3_P6_PIO1_6 N9X_MUX('1',6,2) /* PT1_6 */
#define FC5_P2_PIO1_6 N9X_MUX('1',6,3) /* PT1_6 */
#define CT_INP6_PIO1_6 N9X_MUX('1',6,4) /* PT1_6 */
#define SCT0_IN0_PIO1_6 N9X_MUX('1',6,5) /* PT1_6 */
#define FLEXIO0_D14_PIO1_6 N9X_MUX('1',6,6) /* PT1_6 */
#define SMARTDMA_PIO2_PIO1_6 N9X_MUX('1',6,7) /* PT1_6 */
#define ENET0_TXD0_PIO1_6 N9X_MUX('1',6,9) /* PT1_6 */
#define SAI1_RX_BCLK_PIO1_6 N9X_MUX('1',6,10) /* PT1_6 */
#define CAN1_TXD_PIO1_6 N9X_MUX('1',6,11) /* PT1_6 */
#define PIO1_7 N9X_MUX('1',7,0) /* PT1_7 */
#define TSI0_CH7_PIO1_7 N9X_MUX('1',7,0) /* PT1_7 */
#define ADC0_A23_PIO1_7 N9X_MUX('1',7,0) /* PT1_7 */
#define WUU0_IN9_PIO1_7 N9X_MUX('1',7,0) /* PT1_7 */
#define TRIG_OUT2_PIO1_7 N9X_MUX('1',7,1) /* PT1_7 */
#define FC5_P3_PIO1_7 N9X_MUX('1',7,3) /* PT1_7 */
#define CT_INP7_PIO1_7 N9X_MUX('1',7,4) /* PT1_7 */
#define SCT0_IN1_PIO1_7 N9X_MUX('1',7,5) /* PT1_7 */
#define FLEXIO0_D15_PIO1_7 N9X_MUX('1',7,6) /* PT1_7 */
#define SMARTDMA_PIO3_PIO1_7 N9X_MUX('1',7,7) /* PT1_7 */
#define PLU_CLK_PIO1_7 N9X_MUX('1',7,8) /* PT1_7 */
#define ENET0_TXD1_PIO1_7 N9X_MUX('1',7,9) /* PT1_7 */
#define SAI1_RX_FS_PIO1_7 N9X_MUX('1',7,10) /* PT1_7 */
#define CAN1_RXD_PIO1_7 N9X_MUX('1',7,11) /* PT1_7 */
#define PIO1_8 N9X_MUX('1',8,0) /* PT1_8 */
#define ADC1_A8_PIO1_8 N9X_MUX('1',8,0) /* PT1_8 */
#define TSI0_CH17_PIO1_8 N9X_MUX('1',8,0) /* PT1_8 */
#define WUU0_IN10_PIO1_8 N9X_MUX('1',8,0) /* PT1_8 */
#define TRACE_DATA0_PIO1_8 N9X_MUX('1',8,1) /* PT1_8 */
#define FC4_P0_PIO1_8 N9X_MUX('1',8,2) /* PT1_8 */
#define FC5_P4_PIO1_8 N9X_MUX('1',8,3) /* PT1_8 */
#define CT_INP8_PIO1_8 N9X_MUX('1',8,4) /* PT1_8 */
#define SCT0_OUT2_PIO1_8 N9X_MUX('1',8,5) /* PT1_8 */
#define FLEXIO0_D16_PIO1_8 N9X_MUX('1',8,6) /* PT1_8 */
#define SMARTDMA_PIO4_PIO1_8 N9X_MUX('1',8,7) /* PT1_8 */
#define PLU_OUT0_PIO1_8 N9X_MUX('1',8,8) /* PT1_8 */
#define ENET0_TXD2_PIO1_8 N9X_MUX('1',8,9) /* PT1_8 */
#define I3C1_SDA_PIO1_8 N9X_MUX('1',8,10) /* PT1_8 */
#define PIO1_9 N9X_MUX('1',9,0) /* PT1_9 */
#define ADC1_A9_PIO1_9 N9X_MUX('1',9,0) /* PT1_9 */
#define TSI0_CH18_PIO1_9 N9X_MUX('1',9,0) /* PT1_9 */
#define TRACE_DATA1_PIO1_9 N9X_MUX('1',9,1) /* PT1_9 */
#define FC4_P1_PIO1_9 N9X_MUX('1',9,2) /* PT1_9 */
#define FC5_P5_PIO1_9 N9X_MUX('1',9,3) /* PT1_9 */
#define CT_INP9_PIO1_9 N9X_MUX('1',9,4) /* PT1_9 */
#define SCT0_OUT3_PIO1_9 N9X_MUX('1',9,5) /* PT1_9 */
#define FLEXIO0_D17_PIO1_9 N9X_MUX('1',9,6) /* PT1_9 */
#define SMARTDMA_PIO5_PIO1_9 N9X_MUX('1',9,7) /* PT1_9 */
#define PLU_OUT1_PIO1_9 N9X_MUX('1',9,8) /* PT1_9 */
#define ENET0_TXD3_PIO1_9 N9X_MUX('1',9,9) /* PT1_9 */
#define I3C1_SCL_PIO1_9 N9X_MUX('1',9,10) /* PT1_9 */
#define PIO1_10 N9X_MUX('1',10,0) /* PT1_10 */
#define ADC1_A10_PIO1_10 N9X_MUX('1',10,0) /* PT1_10 */
#define TSI0_CH19_PIO1_10 N9X_MUX('1',10,0) /* PT1_10 */
#define TRACE_DATA2_PIO1_10 N9X_MUX('1',10,1) /* PT1_10 */
#define FC4_P2_PIO1_10 N9X_MUX('1',10,2) /* PT1_10 */
#define FC5_P6_PIO1_10 N9X_MUX('1',10,3) /* PT1_10 */
#define CT2_MAT0_PIO1_10 N9X_MUX('1',10,4) /* PT1_10 */
#define SCT0_IN2_PIO1_10 N9X_MUX('1',10,5) /* PT1_10 */
#define FLEXIO0_D18_PIO1_10 N9X_MUX('1',10,6) /* PT1_10 */
#define SMARTDMA_PIO6_PIO1_10 N9X_MUX('1',10,7) /* PT1_10 */
#define PLU_IN0_PIO1_10 N9X_MUX('1',10,8) /* PT1_10 */
#define ENET0_TXER_PIO1_10 N9X_MUX('1',10,9) /* PT1_10 */
#define CAN0_TXD_PIO1_10 N9X_MUX('1',10,11) /* PT1_10 */
#define PIO1_11 N9X_MUX('1',11,0) /* PT1_11 */
#define TSI0_CH20_PIO1_11 N9X_MUX('1',11,0) /* PT1_11 */
#define ADC1_A11_PIO1_11 N9X_MUX('1',11,0) /* PT1_11 */
#define WUU0_IN11_PIO1_11 N9X_MUX('1',11,0) /* PT1_11 */
#define TRACE_DATA3_PIO1_11 N9X_MUX('1',11,1) /* PT1_11 */
#define FC4_P3_PIO1_11 N9X_MUX('1',11,2) /* PT1_11 */
#define CT2_MAT1_PIO1_11 N9X_MUX('1',11,4) /* PT1_11 */
#define SCT0_IN3_PIO1_11 N9X_MUX('1',11,5) /* PT1_11 */
#define FLEXIO0_D19_PIO1_11 N9X_MUX('1',11,6) /* PT1_11 */
#define SMARTDMA_PIO7_PIO1_11 N9X_MUX('1',11,7) /* PT1_11 */
#define PLU_IN1_PIO1_11 N9X_MUX('1',11,8) /* PT1_11 */
#define ENET0_RX_CLK_PIO1_11 N9X_MUX('1',11,9) /* PT1_11 */
#define I3C1_PUR_PIO1_11 N9X_MUX('1',11,10) /* PT1_11 */
#define CAN0_RXD_PIO1_11 N9X_MUX('1',11,11) /* PT1_11 */
#define PIO1_12 N9X_MUX('1',12,0) /* PT1_12 */
#define TSI0_CH21_PIO1_12 N9X_MUX('1',12,0) /* PT1_12 */
#define WUU0_IN12_PIO1_12 N9X_MUX('1',12,0) /* PT1_12 */
#define ADC1_A12_PIO1_12 N9X_MUX('1',12,0) /* PT1_12 */
#define TRACE_CLK_PIO1_12 N9X_MUX('1',12,1) /* PT1_12 */
#define FC4_P4_PIO1_12 N9X_MUX('1',12,2) /* PT1_12 */
#define FC3_P0_PIO1_12 N9X_MUX('1',12,3) /* PT1_12 */
#define CT2_MAT2_PIO1_12 N9X_MUX('1',12,4) /* PT1_12 */
#define SCT0_OUT4_PIO1_12 N9X_MUX('1',12,5) /* PT1_12 */
#define FLEXIO0_D20_PIO1_12 N9X_MUX('1',12,6) /* PT1_12 */
#define SMARTDMA_PIO8_PIO1_12 N9X_MUX('1',12,7) /* PT1_12 */
#define PLU_OUT2_PIO1_12 N9X_MUX('1',12,8) /* PT1_12 */
#define ENET0_RXER_PIO1_12 N9X_MUX('1',12,9) /* PT1_12 */
#define CAN1_RXD_PIO1_12 N9X_MUX('1',12,11) /* PT1_12 */
#define TSI0_CH22_PIO1_13 N9X_MUX('1',13,0) /* PT1_13 */
#define ADC1_A13_PIO1_13 N9X_MUX('1',13,0) /* PT1_13 */
#define PIO1_13 N9X_MUX('1',13,0) /* PT1_13 */
#define TRIG_IN3_PIO1_13 N9X_MUX('1',13,1) /* PT1_13 */
#define FC4_P5_PIO1_13 N9X_MUX('1',13,2) /* PT1_13 */
#define FC3_P1_PIO1_13 N9X_MUX('1',13,3) /* PT1_13 */
#define CT2_MAT3_PIO1_13 N9X_MUX('1',13,4) /* PT1_13 */
#define SCT0_OUT5_PIO1_13 N9X_MUX('1',13,5) /* PT1_13 */
#define FLEXIO0_D21_PIO1_13 N9X_MUX('1',13,6) /* PT1_13 */
#define SMARTDMA_PIO9_PIO1_13 N9X_MUX('1',13,7) /* PT1_13 */
#define PLU_OUT3_PIO1_13 N9X_MUX('1',13,8) /* PT1_13 */
#define ENET0_RXDV_PIO1_13 N9X_MUX('1',13,9) /* PT1_13 */
#define CAN1_TXD_PIO1_13 N9X_MUX('1',13,11) /* PT1_13 */
#define PIO1_14 N9X_MUX('1',14,0) /* PT1_14 */
#define TSI0_CH23_PIO1_14 N9X_MUX('1',14,0) /* PT1_14 */
#define ADC1_A14_PIO1_14 N9X_MUX('1',14,0) /* PT1_14 */
#define FC4_P6_PIO1_14 N9X_MUX('1',14,2) /* PT1_14 */
#define FC3_P2_PIO1_14 N9X_MUX('1',14,3) /* PT1_14 */
#define CT_INP10_PIO1_14 N9X_MUX('1',14,4) /* PT1_14 */
#define SCT0_IN4_PIO1_14 N9X_MUX('1',14,5) /* PT1_14 */
#define FLEXIO0_D22_PIO1_14 N9X_MUX('1',14,6) /* PT1_14 */
#define SMARTDMA_PIO10_PIO1_14 N9X_MUX('1',14,7) /* PT1_14 */
#define PLU_IN2_PIO1_14 N9X_MUX('1',14,8) /* PT1_14 */
#define ENET0_RXD0_PIO1_14 N9X_MUX('1',14,9) /* PT1_14 */
#define PIO1_15 N9X_MUX('1',15,0) /* PT1_15 */
#define WUU0_IN13_PIO1_15 N9X_MUX('1',15,0) /* PT1_15 */
#define ADC1_A15_PIO1_15 N9X_MUX('1',15,0) /* PT1_15 */
#define TSI0_CH24_PIO1_15 N9X_MUX('1',15,0) /* PT1_15 */
#define FC3_P3_PIO1_15 N9X_MUX('1',15,3) /* PT1_15 */
#define CT_INP11_PIO1_15 N9X_MUX('1',15,4) /* PT1_15 */
#define SCT0_IN5_PIO1_15 N9X_MUX('1',15,5) /* PT1_15 */
#define FLEXIO0_D23_PIO1_15 N9X_MUX('1',15,6) /* PT1_15 */
#define SMARTDMA_PIO11_PIO1_15 N9X_MUX('1',15,7) /* PT1_15 */
#define PLU_IN3_PIO1_15 N9X_MUX('1',15,8) /* PT1_15 */
#define ENET0_RXD1_PIO1_15 N9X_MUX('1',15,9) /* PT1_15 */
#define I3C1_PUR_PIO1_15 N9X_MUX('1',15,10) /* PT1_15 */
#define PIO1_16 N9X_MUX('1',16,0) /* PT1_16 */
#define ADC1_A16_PIO1_16 N9X_MUX('1',16,0) /* PT1_16 */
#define WUU0_IN14_PIO1_16 N9X_MUX('1',16,0) /* PT1_16 */
#define FC5_P0_PIO1_16 N9X_MUX('1',16,2) /* PT1_16 */
#define FC3_P4_PIO1_16 N9X_MUX('1',16,3) /* PT1_16 */
#define CT_INP12_PIO1_16 N9X_MUX('1',16,4) /* PT1_16 */
#define SCT0_OUT6_PIO1_16 N9X_MUX('1',16,5) /* PT1_16 */
#define FLEXIO0_D24_PIO1_16 N9X_MUX('1',16,6) /* PT1_16 */
#define SMARTDMA_PIO12_PIO1_16 N9X_MUX('1',16,7) /* PT1_16 */
#define PLU_OUT4_PIO1_16 N9X_MUX('1',16,8) /* PT1_16 */
#define ENET0_RXD2_PIO1_16 N9X_MUX('1',16,9) /* PT1_16 */
#define I3C1_SDA_PIO1_16 N9X_MUX('1',16,10) /* PT1_16 */
#define PIO1_17 N9X_MUX('1',17,0) /* PT1_17 */
#define ADC1_A17_PIO1_17 N9X_MUX('1',17,0) /* PT1_17 */
#define FC5_P1_PIO1_17 N9X_MUX('1',17,2) /* PT1_17 */
#define FC3_P5_PIO1_17 N9X_MUX('1',17,3) /* PT1_17 */
#define CT_INP13_PIO1_17 N9X_MUX('1',17,4) /* PT1_17 */
#define SCT0_OUT7_PIO1_17 N9X_MUX('1',17,5) /* PT1_17 */
#define FLEXIO0_D25_PIO1_17 N9X_MUX('1',17,6) /* PT1_17 */
#define SMARTDMA_PIO13_PIO1_17 N9X_MUX('1',17,7) /* PT1_17 */
#define PLU_OUT5_PIO1_17 N9X_MUX('1',17,8) /* PT1_17 */
#define ENET0_RXD3_PIO1_17 N9X_MUX('1',17,9) /* PT1_17 */
#define I3C1_SCL_PIO1_17 N9X_MUX('1',17,10) /* PT1_17 */
#define PIO1_18 N9X_MUX('1',18,0) /* PT1_18 */
#define ADC1_A18_PIO1_18 N9X_MUX('1',18,0) /* PT1_18 */
#define FREQME_CLK_IN0_PIO1_18 N9X_MUX('1',18,1) /* PT1_18 */
#define FC5_P2_PIO1_18 N9X_MUX('1',18,2) /* PT1_18 */
