zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxn/pinctrl/MCXN947VDF-pinctrl.h
#define FC3_P6_PIO1_18 N9X_MUX('1',18,3) /* PT1_18 */
#define CT3_MAT0_PIO1_18 N9X_MUX('1',18,4) /* PT1_18 */
#define SCT0_IN6_PIO1_18 N9X_MUX('1',18,5) /* PT1_18 */
#define FLEXIO0_D26_PIO1_18 N9X_MUX('1',18,6) /* PT1_18 */
#define SMARTDMA_PIO14_PIO1_18 N9X_MUX('1',18,7) /* PT1_18 */
#define PLU_IN4_PIO1_18 N9X_MUX('1',18,8) /* PT1_18 */
#define ENET0_COL_PIO1_18 N9X_MUX('1',18,9) /* PT1_18 */
#define CAN0_TXD_PIO1_18 N9X_MUX('1',18,11) /* PT1_18 */
#define PIO1_19 N9X_MUX('1',19,0) /* PT1_19 */
#define ADC1_A19_PIO1_19 N9X_MUX('1',19,0) /* PT1_19 */
#define WUU0_IN15_PIO1_19 N9X_MUX('1',19,0) /* PT1_19 */
#define FREQME_CLK_IN1_PIO1_19 N9X_MUX('1',19,1) /* PT1_19 */
#define FC5_P3_PIO1_19 N9X_MUX('1',19,2) /* PT1_19 */
#define CT3_MAT1_PIO1_19 N9X_MUX('1',19,4) /* PT1_19 */
#define SCT0_IN7_PIO1_19 N9X_MUX('1',19,5) /* PT1_19 */
#define FLEXIO0_D27_PIO1_19 N9X_MUX('1',19,6) /* PT1_19 */
#define SMARTDMA_PIO15_PIO1_19 N9X_MUX('1',19,7) /* PT1_19 */
#define PLU_IN5_PIO1_19 N9X_MUX('1',19,8) /* PT1_19 */
#define ENET0_CRS_PIO1_19 N9X_MUX('1',19,9) /* PT1_19 */
#define CAN0_RXD_PIO1_19 N9X_MUX('1',19,11) /* PT1_19 */
#define PIO1_20 N9X_MUX('1',20,0) /* PT1_20 */
#define ADC1_A20_PIO1_20 N9X_MUX('1',20,0) /* PT1_20 */
#define CMP1_IN3_PIO1_20 N9X_MUX('1',20,0) /* PT1_20 */
#define TRIG_IN2_PIO1_20 N9X_MUX('1',20,1) /* PT1_20 */
#define FC5_P4_PIO1_20 N9X_MUX('1',20,2) /* PT1_20 */
#define FC4_P0_PIO1_20 N9X_MUX('1',20,3) /* PT1_20 */
#define CT3_MAT2_PIO1_20 N9X_MUX('1',20,4) /* PT1_20 */
#define SCT0_OUT8_PIO1_20 N9X_MUX('1',20,5) /* PT1_20 */
#define FLEXIO0_D28_PIO1_20 N9X_MUX('1',20,6) /* PT1_20 */
#define SMARTDMA_PIO16_PIO1_20 N9X_MUX('1',20,7) /* PT1_20 */
#define PLU_OUT6_PIO1_20 N9X_MUX('1',20,8) /* PT1_20 */
#define ENET0_MDC_PIO1_20 N9X_MUX('1',20,9) /* PT1_20 */
#define CAN1_TXD_PIO1_20 N9X_MUX('1',20,11) /* PT1_20 */
#define PIO1_21 N9X_MUX('1',21,0) /* PT1_21 */
#define ADC1_A21_PIO1_21 N9X_MUX('1',21,0) /* PT1_21 */
#define CMP2_IN3_PIO1_21 N9X_MUX('1',21,0) /* PT1_21 */
#define TRIG_OUT2_PIO1_21 N9X_MUX('1',21,1) /* PT1_21 */
#define FC5_P5_PIO1_21 N9X_MUX('1',21,2) /* PT1_21 */
#define FC4_P1_PIO1_21 N9X_MUX('1',21,3) /* PT1_21 */
#define CT3_MAT3_PIO1_21 N9X_MUX('1',21,4) /* PT1_21 */
#define SCT0_OUT9_PIO1_21 N9X_MUX('1',21,5) /* PT1_21 */
#define FLEXIO0_D29_PIO1_21 N9X_MUX('1',21,6) /* PT1_21 */
#define SMARTDMA_PIO17_PIO1_21 N9X_MUX('1',21,7) /* PT1_21 */
#define PLU_OUT7_PIO1_21 N9X_MUX('1',21,8) /* PT1_21 */
#define ENET0_MDIO_PIO1_21 N9X_MUX('1',21,9) /* PT1_21 */
#define SAI1_MCLK_PIO1_21 N9X_MUX('1',21,10) /* PT1_21 */
#define CAN1_RXD_PIO1_21 N9X_MUX('1',21,11) /* PT1_21 */
#define PIO1_22 N9X_MUX('1',22,0) /* PT1_22 */
#define ADC1_A22_PIO1_22 N9X_MUX('1',22,0) /* PT1_22 */
#define TRIG_IN3_PIO1_22 N9X_MUX('1',22,1) /* PT1_22 */
#define FC5_P6_PIO1_22 N9X_MUX('1',22,2) /* PT1_22 */
#define FC4_P2_PIO1_22 N9X_MUX('1',22,3) /* PT1_22 */
#define CT_INP14_PIO1_22 N9X_MUX('1',22,4) /* PT1_22 */
#define SCT0_OUT4_PIO1_22 N9X_MUX('1',22,5) /* PT1_22 */
#define FLEXIO0_D30_PIO1_22 N9X_MUX('1',22,6) /* PT1_22 */
#define SMARTDMA_PIO18_PIO1_22 N9X_MUX('1',22,7) /* PT1_22 */
#define PIO1_23 N9X_MUX('1',23,0) /* PT1_23 */
#define ADC1_A23_PIO1_23 N9X_MUX('1',23,0) /* PT1_23 */
#define FC4_P3_PIO1_23 N9X_MUX('1',23,3) /* PT1_23 */
#define CT_INP15_PIO1_23 N9X_MUX('1',23,4) /* PT1_23 */
#define SCT0_OUT5_PIO1_23 N9X_MUX('1',23,5) /* PT1_23 */
#define FLEXIO0_D31_PIO1_23 N9X_MUX('1',23,6) /* PT1_23 */
#define SMARTDMA_PIO19_PIO1_23 N9X_MUX('1',23,7) /* PT1_23 */
#define PIO1_30 N9X_MUX('1',30,0) /* PT1_30 */
#define XTAL48M_PIO1_30 N9X_MUX('1',30,0) /* PT1_30 */
#define TRIG_OUT3_PIO1_30 N9X_MUX('1',30,1) /* PT1_30 */
#define CT_INP16_PIO1_30 N9X_MUX('1',30,4) /* PT1_30 */
#define SCT0_OUT8_PIO1_30 N9X_MUX('1',30,5) /* PT1_30 */
#define SAI0_MCLK_PIO1_30 N9X_MUX('1',30,10) /* PT1_30 */
#define PIO1_31 N9X_MUX('1',31,0) /* PT1_31 */
#define EXTAL48M_PIO1_31 N9X_MUX('1',31,0) /* PT1_31 */
#define TRIG_IN4_PIO1_31 N9X_MUX('1',31,1) /* PT1_31 */
#define CT_INP17_PIO1_31 N9X_MUX('1',31,4) /* PT1_31 */
#define SCT0_OUT9_PIO1_31 N9X_MUX('1',31,5) /* PT1_31 */
#define PIO2_0 N9X_MUX('2',0,0) /* PT2_0 */
#define TRIG_IN5_PIO2_0 N9X_MUX('2',0,1) /* PT2_0 */
#define FC9_P6_PIO2_0 N9X_MUX('2',0,2) /* PT2_0 */
#define SDHC0_D5_PIO2_0 N9X_MUX('2',0,3) /* PT2_0 */
#define SCT0_IN0_PIO2_0 N9X_MUX('2',0,4) /* PT2_0 */
#define PWM1_A3_PIO2_0 N9X_MUX('2',0,5) /* PT2_0 */
#define FLEXIO0_D8_PIO2_0 N9X_MUX('2',0,6) /* PT2_0 */
#define SMARTDMA_PIO20_PIO2_0 N9X_MUX('2',0,7) /* PT2_0 */
#define FLEXSPI0_B_SS1_b_PIO2_0 N9X_MUX('2',0,8) /* PT2_0 */
#define SAI0_RX_BCLK_PIO2_0 N9X_MUX('2',0,10) /* PT2_0 */
#define PIO2_1 N9X_MUX('2',1,0) /* PT2_1 */
#define TRACE_CLK_PIO2_1 N9X_MUX('2',1,1) /* PT2_1 */
#define SDHC0_D4_PIO2_1 N9X_MUX('2',1,3) /* PT2_1 */
#define SCT0_IN1_PIO2_1 N9X_MUX('2',1,4) /* PT2_1 */
#define PWM1_B3_PIO2_1 N9X_MUX('2',1,5) /* PT2_1 */
#define FLEXIO0_D9_PIO2_1 N9X_MUX('2',1,6) /* PT2_1 */
#define SMARTDMA_PIO21_PIO2_1 N9X_MUX('2',1,7) /* PT2_1 */
#define FLEXSPI0_B_DQS_PIO2_1 N9X_MUX('2',1,8) /* PT2_1 */
#define SINC0_MCLK_OUT0_PIO2_1 N9X_MUX('2',1,9) /* PT2_1 */
#define SAI0_RX_FS_PIO2_1 N9X_MUX('2',1,10) /* PT2_1 */
#define PIO2_2 N9X_MUX('2',2,0) /* PT2_2 */
#define WUU0_IN16_PIO2_2 N9X_MUX('2',2,0) /* PT2_2 */
#define CLKOUT_PIO2_2 N9X_MUX('2',2,1) /* PT2_2 */
#define FC9_P3_PIO2_2 N9X_MUX('2',2,2) /* PT2_2 */
#define SDHC0_D1_PIO2_2 N9X_MUX('2',2,3) /* PT2_2 */
#define SCT0_OUT0_PIO2_2 N9X_MUX('2',2,4) /* PT2_2 */
#define PWM1_A2_PIO2_2 N9X_MUX('2',2,5) /* PT2_2 */
#define FLEXIO0_D10_PIO2_2 N9X_MUX('2',2,6) /* PT2_2 */
#define SMARTDMA_PIO22_PIO2_2 N9X_MUX('2',2,7) /* PT2_2 */
#define FLEXSPI0_B_SS0_b_PIO2_2 N9X_MUX('2',2,8) /* PT2_2 */
#define SINC0_MCLK0_PIO2_2 N9X_MUX('2',2,9) /* PT2_2 */
#define SAI0_TXD0_PIO2_2 N9X_MUX('2',2,10) /* PT2_2 */
#define PIO2_3 N9X_MUX('2',3,0) /* PT2_3 */
#define FC9_P1_PIO2_3 N9X_MUX('2',3,2) /* PT2_3 */
#define SDHC0_D0_PIO2_3 N9X_MUX('2',3,3) /* PT2_3 */
#define SCT0_OUT1_PIO2_3 N9X_MUX('2',3,4) /* PT2_3 */
#define PWM1_B2_PIO2_3 N9X_MUX('2',3,5) /* PT2_3 */
#define FLEXIO0_D11_PIO2_3 N9X_MUX('2',3,6) /* PT2_3 */
#define SMARTDMA_PIO23_PIO2_3 N9X_MUX('2',3,7) /* PT2_3 */
#define FLEXSPI0_B_SCLK_PIO2_3 N9X_MUX('2',3,8) /* PT2_3 */
#define SINC0_MBIT0_PIO2_3 N9X_MUX('2',3,9) /* PT2_3 */
#define SAI0_RXD0_PIO2_3 N9X_MUX('2',3,10) /* PT2_3 */
#define PIO2_4 N9X_MUX('2',4,0) /* PT2_4 */
#define WUU0_IN17_PIO2_4 N9X_MUX('2',4,0) /* PT2_4 */
#define FC9_P0_PIO2_4 N9X_MUX('2',4,2) /* PT2_4 */
#define SDHC0_CLK_PIO2_4 N9X_MUX('2',4,3) /* PT2_4 */
#define SCT0_OUT2_PIO2_4 N9X_MUX('2',4,4) /* PT2_4 */
#define PWM1_A1_PIO2_4 N9X_MUX('2',4,5) /* PT2_4 */
#define FLEXIO0_D12_PIO2_4 N9X_MUX('2',4,6) /* PT2_4 */
#define SMARTDMA_PIO24_PIO2_4 N9X_MUX('2',4,7) /* PT2_4 */
#define FLEXSPI0_B_DATA0_PIO2_4 N9X_MUX('2',4,8) /* PT2_4 */
#define SINC0_MCLK1_PIO2_4 N9X_MUX('2',4,9) /* PT2_4 */
#define SAI0_RXD1_PIO2_4 N9X_MUX('2',4,10) /* PT2_4 */
#define PIO2_5 N9X_MUX('2',5,0) /* PT2_5 */
#define TRIG_OUT3_PIO2_5 N9X_MUX('2',5,1) /* PT2_5 */
#define FC9_P2_PIO2_5 N9X_MUX('2',5,2) /* PT2_5 */
#define SDHC0_CMD_PIO2_5 N9X_MUX('2',5,3) /* PT2_5 */
#define SCT0_OUT3_PIO2_5 N9X_MUX('2',5,4) /* PT2_5 */
#define PWM1_B1_PIO2_5 N9X_MUX('2',5,5) /* PT2_5 */
#define FLEXIO0_D13_PIO2_5 N9X_MUX('2',5,6) /* PT2_5 */
#define SMARTDMA_PIO25_PIO2_5 N9X_MUX('2',5,7) /* PT2_5 */
#define FLEXSPI0_B_DATA1_PIO2_5 N9X_MUX('2',5,8) /* PT2_5 */
#define SINC0_MBIT1_PIO2_5 N9X_MUX('2',5,9) /* PT2_5 */
#define SAI0_TXD1_PIO2_5 N9X_MUX('2',5,10) /* PT2_5 */
#define PIO2_6 N9X_MUX('2',6,0) /* PT2_6 */
#define TRIG_IN4_PIO2_6 N9X_MUX('2',6,1) /* PT2_6 */
#define FC9_P4_PIO2_6 N9X_MUX('2',6,2) /* PT2_6 */
#define SDHC0_D3_PIO2_6 N9X_MUX('2',6,3) /* PT2_6 */
#define SCT0_OUT4_PIO2_6 N9X_MUX('2',6,4) /* PT2_6 */
#define PWM1_A0_PIO2_6 N9X_MUX('2',6,5) /* PT2_6 */
#define FLEXIO0_D14_PIO2_6 N9X_MUX('2',6,6) /* PT2_6 */
#define SMARTDMA_PIO26_PIO2_6 N9X_MUX('2',6,7) /* PT2_6 */
#define FLEXSPI0_B_DATA2_PIO2_6 N9X_MUX('2',6,8) /* PT2_6 */
#define SINC0_MCLK2_PIO2_6 N9X_MUX('2',6,9) /* PT2_6 */
#define SAI0_TX_BCLK_PIO2_6 N9X_MUX('2',6,10) /* PT2_6 */
#define PIO2_7 N9X_MUX('2',7,0) /* PT2_7 */
#define TRIG_IN5_PIO2_7 N9X_MUX('2',7,1) /* PT2_7 */
#define FC9_P5_PIO2_7 N9X_MUX('2',7,2) /* PT2_7 */
#define SDHC0_D2_PIO2_7 N9X_MUX('2',7,3) /* PT2_7 */
#define SCT0_OUT5_PIO2_7 N9X_MUX('2',7,4) /* PT2_7 */
#define PWM1_B0_PIO2_7 N9X_MUX('2',7,5) /* PT2_7 */
#define FLEXIO0_D15_PIO2_7 N9X_MUX('2',7,6) /* PT2_7 */
#define SMARTDMA_PIO27_PIO2_7 N9X_MUX('2',7,7) /* PT2_7 */
#define FLEXSPI0_B_DATA3_PIO2_7 N9X_MUX('2',7,8) /* PT2_7 */
#define SINC0_MBIT2_PIO2_7 N9X_MUX('2',7,9) /* PT2_7 */
#define SAI0_TX_FS_PIO2_7 N9X_MUX('2',7,10) /* PT2_7 */
#define PIO2_8 N9X_MUX('2',8,0) /* PT2_8 */
#define TRACE_DATA0_PIO2_8 N9X_MUX('2',8,1) /* PT2_8 */
#define SDHC0_D7_PIO2_8 N9X_MUX('2',8,3) /* PT2_8 */
#define SCT0_IN2_PIO2_8 N9X_MUX('2',8,4) /* PT2_8 */
#define PWM1_X0_PIO2_8 N9X_MUX('2',8,5) /* PT2_8 */
#define FLEXIO0_D16_PIO2_8 N9X_MUX('2',8,6) /* PT2_8 */
#define SMARTDMA_PIO28_PIO2_8 N9X_MUX('2',8,7) /* PT2_8 */
#define FLEXSPI0_B_DATA4_PIO2_8 N9X_MUX('2',8,8) /* PT2_8 */
#define SINC0_MCLK3_PIO2_8 N9X_MUX('2',8,9) /* PT2_8 */
#define SAI1_TXD0_PIO2_8 N9X_MUX('2',8,10) /* PT2_8 */
#define PIO2_9 N9X_MUX('2',9,0) /* PT2_9 */
#define TRACE_DATA1_PIO2_9 N9X_MUX('2',9,1) /* PT2_9 */
#define SDHC0_D6_PIO2_9 N9X_MUX('2',9,3) /* PT2_9 */
#define SCT0_IN3_PIO2_9 N9X_MUX('2',9,4) /* PT2_9 */
#define PWM1_X1_PIO2_9 N9X_MUX('2',9,5) /* PT2_9 */
#define FLEXIO0_D17_PIO2_9 N9X_MUX('2',9,6) /* PT2_9 */
#define SMARTDMA_PIO29_PIO2_9 N9X_MUX('2',9,7) /* PT2_9 */
#define FLEXSPI0_B_DATA5_PIO2_9 N9X_MUX('2',9,8) /* PT2_9 */
#define SINC0_MBIT3_PIO2_9 N9X_MUX('2',9,9) /* PT2_9 */
#define SAI1_RXD0_PIO2_9 N9X_MUX('2',9,10) /* PT2_9 */
#define PIO2_10 N9X_MUX('2',10,0) /* PT2_10 */
#define TRACE_DATA2_PIO2_10 N9X_MUX('2',10,1) /* PT2_10 */
#define SCT0_IN4_PIO2_10 N9X_MUX('2',10,4) /* PT2_10 */
#define PWM1_X2_PIO2_10 N9X_MUX('2',10,5) /* PT2_10 */
#define FLEXIO0_D18_PIO2_10 N9X_MUX('2',10,6) /* PT2_10 */
#define SMARTDMA_PIO31_PIO2_10 N9X_MUX('2',10,7) /* PT2_10 */
#define FLEXSPI0_B_DATA6_PIO2_10 N9X_MUX('2',10,8) /* PT2_10 */
#define SINC0_MCLK4_PIO2_10 N9X_MUX('2',10,9) /* PT2_10 */
#define SAI1_RXD1_PIO2_10 N9X_MUX('2',10,10) /* PT2_10 */
#define PIO2_11 N9X_MUX('2',11,0) /* PT2_11 */
#define TRACE_DATA3_PIO2_11 N9X_MUX('2',11,1) /* PT2_11 */
#define SCT0_IN5_PIO2_11 N9X_MUX('2',11,4) /* PT2_11 */
#define PWM1_X3_PIO2_11 N9X_MUX('2',11,5) /* PT2_11 */
#define FLEXIO0_D19_PIO2_11 N9X_MUX('2',11,6) /* PT2_11 */
#define SMARTDMA_PIO30_PIO2_11 N9X_MUX('2',11,7) /* PT2_11 */
#define FLEXSPI0_B_DATA7_PIO2_11 N9X_MUX('2',11,8) /* PT2_11 */
#define SINC0_MBIT4_PIO2_11 N9X_MUX('2',11,9) /* PT2_11 */
#define SAI1_TXD1_PIO2_11 N9X_MUX('2',11,10) /* PT2_11 */
#define WUU0_IN22_PIO3_0 N9X_MUX('3',0,0) /* PT3_0 */
#define PIO3_0 N9X_MUX('3',0,0) /* PT3_0 */
#define TRIG_IN0_PIO3_0 N9X_MUX('3',0,1) /* PT3_0 */
#define FC7_P3_PIO3_0 N9X_MUX('3',0,3) /* PT3_0 */
#define CT_INP16_PIO3_0 N9X_MUX('3',0,4) /* PT3_0 */
#define PWM0_A0_PIO3_0 N9X_MUX('3',0,5) /* PT3_0 */
#define FLEXIO0_D8_PIO3_0 N9X_MUX('3',0,6) /* PT3_0 */
#define SMARTDMA_PIO0_PIO3_0 N9X_MUX('3',0,7) /* PT3_0 */
#define FLEXSPI0_A_SS0_b_PIO3_0 N9X_MUX('3',0,8) /* PT3_0 */
#define PF_QSPI_CS0_DIS_PIO3_0 N9X_MUX('3',0,11) /* PT3_0 */
#define PIO3_1 N9X_MUX('3',1,0) /* PT3_1 */
#define TRIG_IN1_PIO3_1 N9X_MUX('3',1,1) /* PT3_1 */
#define FC6_P0_PIO3_1 N9X_MUX('3',1,2) /* PT3_1 */
#define FC7_P6_PIO3_1 N9X_MUX('3',1,3) /* PT3_1 */
#define CT_INP17_PIO3_1 N9X_MUX('3',1,4) /* PT3_1 */
#define PWM0_B0_PIO3_1 N9X_MUX('3',1,5) /* PT3_1 */
#define FLEXIO0_D9_PIO3_1 N9X_MUX('3',1,6) /* PT3_1 */
#define SMARTDMA_PIO1_PIO3_1 N9X_MUX('3',1,7) /* PT3_1 */
#define FLEXSPI0_A_SS1_b_PIO3_1 N9X_MUX('3',1,8) /* PT3_1 */
#define PF_QSPI_CS1_DIS_PIO3_1 N9X_MUX('3',1,11) /* PT3_1 */
#define PIO3_2 N9X_MUX('3',2,0) /* PT3_2 */
#define FC7_P0_PIO3_2 N9X_MUX('3',2,2) /* PT3_2 */
#define CT4_MAT0_PIO3_2 N9X_MUX('3',2,4) /* PT3_2 */
#define PWM0_X0_PIO3_2 N9X_MUX('3',2,5) /* PT3_2 */
#define FLEXIO0_D10_PIO3_2 N9X_MUX('3',2,6) /* PT3_2 */
#define SMARTDMA_PIO2_PIO3_2 N9X_MUX('3',2,7) /* PT3_2 */
#define SIM1_PD_PIO3_2 N9X_MUX('3',2,9) /* PT3_2 */
#define PIO3_3 N9X_MUX('3',3,0) /* PT3_3 */
#define FC7_P1_PIO3_3 N9X_MUX('3',3,2) /* PT3_3 */
#define CT4_MAT1_PIO3_3 N9X_MUX('3',3,4) /* PT3_3 */
#define PWM0_X1_PIO3_3 N9X_MUX('3',3,5) /* PT3_3 */
#define FLEXIO0_D11_PIO3_3 N9X_MUX('3',3,6) /* PT3_3 */
#define SMARTDMA_PIO3_PIO3_3 N9X_MUX('3',3,7) /* PT3_3 */
#define SIM1_RST_PIO3_3 N9X_MUX('3',3,9) /* PT3_3 */
#define PIO3_4 N9X_MUX('3',4,0) /* PT3_4 */
#define FC7_P2_PIO3_4 N9X_MUX('3',4,2) /* PT3_4 */
#define CT_INP18_PIO3_4 N9X_MUX('3',4,4) /* PT3_4 */
#define PWM0_X2_PIO3_4 N9X_MUX('3',4,5) /* PT3_4 */
#define FLEXIO0_D12_PIO3_4 N9X_MUX('3',4,6) /* PT3_4 */
#define SMARTDMA_PIO4_PIO3_4 N9X_MUX('3',4,7) /* PT3_4 */
#define SIM1_CLK_PIO3_4 N9X_MUX('3',4,9) /* PT3_4 */
#define PIO3_5 N9X_MUX('3',5,0) /* PT3_5 */
#define FC7_P3_PIO3_5 N9X_MUX('3',5,2) /* PT3_5 */
#define CT_INP19_PIO3_5 N9X_MUX('3',5,4) /* PT3_5 */
#define PWM0_X3_PIO3_5 N9X_MUX('3',5,5) /* PT3_5 */
#define FLEXIO0_D13_PIO3_5 N9X_MUX('3',5,6) /* PT3_5 */
#define SMARTDMA_PIO5_PIO3_5 N9X_MUX('3',5,7) /* PT3_5 */
#define SIM1_IO_PIO3_5 N9X_MUX('3',5,9) /* PT3_5 */
#define PIO3_6 N9X_MUX('3',6,0) /* PT3_6 */
#define CLKOUT_PIO3_6 N9X_MUX('3',6,1) /* PT3_6 */
#define FC6_P1_PIO3_6 N9X_MUX('3',6,2) /* PT3_6 */
#define CT4_MAT2_PIO3_6 N9X_MUX('3',6,4) /* PT3_6 */
#define PWM0_A1_PIO3_6 N9X_MUX('3',6,5) /* PT3_6 */
#define FLEXIO0_D14_PIO3_6 N9X_MUX('3',6,6) /* PT3_6 */
#define SMARTDMA_PIO6_PIO3_6 N9X_MUX('3',6,7) /* PT3_6 */
#define FLEXSPI0_A_DQS_PIO3_6 N9X_MUX('3',6,8) /* PT3_6 */
#define SIM1_VCCEN_PIO3_6 N9X_MUX('3',6,9) /* PT3_6 */
#define SAI1_MCLK_PIO3_6 N9X_MUX('3',6,10) /* PT3_6 */
#define PF_QSPI_CS_n_PIO3_6 N9X_MUX('3',6,11) /* PT3_6 */
#define PIO3_7 N9X_MUX('3',7,0) /* PT3_7 */
#define FC6_P6_PIO3_7 N9X_MUX('3',7,2) /* PT3_7 */
#define FC7_P1_PIO3_7 N9X_MUX('3',7,3) /* PT3_7 */
#define CT4_MAT3_PIO3_7 N9X_MUX('3',7,4) /* PT3_7 */
#define PWM0_B1_PIO3_7 N9X_MUX('3',7,5) /* PT3_7 */
#define FLEXIO0_D15_PIO3_7 N9X_MUX('3',7,6) /* PT3_7 */
#define SMARTDMA_PIO7_PIO3_7 N9X_MUX('3',7,7) /* PT3_7 */
#define FLEXSPI0_A_SCLK_PIO3_7 N9X_MUX('3',7,8) /* PT3_7 */
#define SIM0_VCCEN_PIO3_7 N9X_MUX('3',7,9) /* PT3_7 */
#define SAI0_MCLK_PIO3_7 N9X_MUX('3',7,10) /* PT3_7 */
#define PF_QSPI_SCKIN_PIO3_7 N9X_MUX('3',7,11) /* PT3_7 */
#define WUU0_IN23_PIO3_8 N9X_MUX('3',8,0) /* PT3_8 */
#define PIO3_8 N9X_MUX('3',8,0) /* PT3_8 */
#define FC6_P4_PIO3_8 N9X_MUX('3',8,2) /* PT3_8 */
#define FC7_P0_PIO3_8 N9X_MUX('3',8,3) /* PT3_8 */
#define CT_INP4_PIO3_8 N9X_MUX('3',8,4) /* PT3_8 */
#define PWM0_A2_PIO3_8 N9X_MUX('3',8,5) /* PT3_8 */
#define FLEXIO0_D16_PIO3_8 N9X_MUX('3',8,6) /* PT3_8 */
#define SMARTDMA_PIO8_PIO3_8 N9X_MUX('3',8,7) /* PT3_8 */
#define FLEXSPI0_A_DATA0_PIO3_8 N9X_MUX('3',8,8) /* PT3_8 */
#define SIM0_PD_PIO3_8 N9X_MUX('3',8,9) /* PT3_8 */
#define SAI0_TX_BCLK_PIO3_8 N9X_MUX('3',8,10) /* PT3_8 */
#define PF_QSPI_DATA0_PIO3_8 N9X_MUX('3',8,11) /* PT3_8 */
#define PIO3_9 N9X_MUX('3',9,0) /* PT3_9 */
#define FC6_P5_PIO3_9 N9X_MUX('3',9,2) /* PT3_9 */
#define FC7_P2_PIO3_9 N9X_MUX('3',9,3) /* PT3_9 */
#define CT_INP5_PIO3_9 N9X_MUX('3',9,4) /* PT3_9 */
#define PWM0_B2_PIO3_9 N9X_MUX('3',9,5) /* PT3_9 */
#define FLEXIO0_D17_PIO3_9 N9X_MUX('3',9,6) /* PT3_9 */
#define SMARTDMA_PIO9_PIO3_9 N9X_MUX('3',9,7) /* PT3_9 */
#define FLEXSPI0_A_DATA1_PIO3_9 N9X_MUX('3',9,8) /* PT3_9 */
#define SIM0_RST_PIO3_9 N9X_MUX('3',9,9) /* PT3_9 */
#define SAI0_TX_FS_PIO3_9 N9X_MUX('3',9,10) /* PT3_9 */
#define PF_QSPI_DATA1_PIO3_9 N9X_MUX('3',9,11) /* PT3_9 */
#define PIO3_10 N9X_MUX('3',10,0) /* PT3_10 */
#define FC6_P2_PIO3_10 N9X_MUX('3',10,2) /* PT3_10 */
#define FC7_P4_PIO3_10 N9X_MUX('3',10,3) /* PT3_10 */
#define CT1_MAT0_PIO3_10 N9X_MUX('3',10,4) /* PT3_10 */
#define PWM0_A3_PIO3_10 N9X_MUX('3',10,5) /* PT3_10 */
#define FLEXIO0_D18_PIO3_10 N9X_MUX('3',10,6) /* PT3_10 */
#define SMARTDMA_PIO10_PIO3_10 N9X_MUX('3',10,7) /* PT3_10 */
#define FLEXSPI0_A_DATA2_PIO3_10 N9X_MUX('3',10,8) /* PT3_10 */
#define SIM0_CLK_PIO3_10 N9X_MUX('3',10,9) /* PT3_10 */
#define SAI0_TXD0_PIO3_10 N9X_MUX('3',10,10) /* PT3_10 */
#define PF_QSPI_DATA2_PIO3_10 N9X_MUX('3',10,11) /* PT3_10 */
#define PIO3_11 N9X_MUX('3',11,0) /* PT3_11 */
#define WUU0_IN24_PIO3_11 N9X_MUX('3',11,0) /* PT3_11 */
#define FC6_P3_PIO3_11 N9X_MUX('3',11,2) /* PT3_11 */
#define FC7_P5_PIO3_11 N9X_MUX('3',11,3) /* PT3_11 */
#define CT1_MAT1_PIO3_11 N9X_MUX('3',11,4) /* PT3_11 */
#define PWM0_B3_PIO3_11 N9X_MUX('3',11,5) /* PT3_11 */
#define FLEXIO0_D19_PIO3_11 N9X_MUX('3',11,6) /* PT3_11 */
#define SMARTDMA_PIO11_PIO3_11 N9X_MUX('3',11,7) /* PT3_11 */
#define FLEXSPI0_A_DATA3_PIO3_11 N9X_MUX('3',11,8) /* PT3_11 */
#define SIM0_IO_PIO3_11 N9X_MUX('3',11,9) /* PT3_11 */
#define SAI0_RXD0_PIO3_11 N9X_MUX('3',11,10) /* PT3_11 */
#define PF_QSPI_DATA3_PIO3_11 N9X_MUX('3',11,11) /* PT3_11 */
#define PIO3_12 N9X_MUX('3',12,0) /* PT3_12 */
#define FC7_P4_PIO3_12 N9X_MUX('3',12,2) /* PT3_12 */
#define FC6_P4_PIO3_12 N9X_MUX('3',12,3) /* PT3_12 */
#define CT1_MAT2_PIO3_12 N9X_MUX('3',12,4) /* PT3_12 */
#define PWM1_A0_PIO3_12 N9X_MUX('3',12,5) /* PT3_12 */
#define FLEXIO0_D20_PIO3_12 N9X_MUX('3',12,6) /* PT3_12 */
#define SMARTDMA_PIO12_PIO3_12 N9X_MUX('3',12,7) /* PT3_12 */
#define FLEXSPI0_A_DATA4_PIO3_12 N9X_MUX('3',12,8) /* PT3_12 */
#define SAI0_RXD1_PIO3_12 N9X_MUX('3',12,10) /* PT3_12 */
#define PIO3_13 N9X_MUX('3',13,0) /* PT3_13 */
#define FC7_P5_PIO3_13 N9X_MUX('3',13,2) /* PT3_13 */
#define FC6_P5_PIO3_13 N9X_MUX('3',13,3) /* PT3_13 */
#define CT1_MAT3_PIO3_13 N9X_MUX('3',13,4) /* PT3_13 */
#define PWM1_B0_PIO3_13 N9X_MUX('3',13,5) /* PT3_13 */
#define FLEXIO0_D21_PIO3_13 N9X_MUX('3',13,6) /* PT3_13 */
#define SMARTDMA_PIO13_PIO3_13 N9X_MUX('3',13,7) /* PT3_13 */
#define FLEXSPI0_A_DATA5_PIO3_13 N9X_MUX('3',13,8) /* PT3_13 */
#define SAI0_TXD1_PIO3_13 N9X_MUX('3',13,10) /* PT3_13 */
#define PF_SPI_CS0_n_PIO3_13 N9X_MUX('3',13,11) /* PT3_13 */
#define PIO3_14 N9X_MUX('3',14,0) /* PT3_14 */
#define WUU0_IN25_PIO3_14 N9X_MUX('3',14,0) /* PT3_14 */
#define FC8_P0_PIO3_14 N9X_MUX('3',14,2) /* PT3_14 */
#define CT_INP6_PIO3_14 N9X_MUX('3',14,4) /* PT3_14 */
#define PWM1_A1_PIO3_14 N9X_MUX('3',14,5) /* PT3_14 */
#define FLEXIO0_D22_PIO3_14 N9X_MUX('3',14,6) /* PT3_14 */
#define SMARTDMA_PIO14_PIO3_14 N9X_MUX('3',14,7) /* PT3_14 */
#define FLEXSPI0_A_DATA6_PIO3_14 N9X_MUX('3',14,8) /* PT3_14 */
#define SAI0_RX_BCLK_PIO3_14 N9X_MUX('3',14,10) /* PT3_14 */
#define PF_SPI_DATA_PIO3_14 N9X_MUX('3',14,11) /* PT3_14 */
#define PIO3_15 N9X_MUX('3',15,0) /* PT3_15 */
#define FC8_P1_PIO3_15 N9X_MUX('3',15,2) /* PT3_15 */
#define CT_INP7_PIO3_15 N9X_MUX('3',15,4) /* PT3_15 */
#define PWM1_B1_PIO3_15 N9X_MUX('3',15,5) /* PT3_15 */
#define FLEXIO0_D23_PIO3_15 N9X_MUX('3',15,6) /* PT3_15 */
#define SMARTDMA_PIO15_PIO3_15 N9X_MUX('3',15,7) /* PT3_15 */
#define FLEXSPI0_A_DATA7_PIO3_15 N9X_MUX('3',15,8) /* PT3_15 */
#define SAI0_RX_FS_PIO3_15 N9X_MUX('3',15,10) /* PT3_15 */
#define PF_SPI_SCKIN_PIO3_15 N9X_MUX('3',15,11) /* PT3_15 */
#define PIO3_16 N9X_MUX('3',16,0) /* PT3_16 */
#define FC8_P2_PIO3_16 N9X_MUX('3',16,2) /* PT3_16 */
#define CT_INP8_PIO3_16 N9X_MUX('3',16,4) /* PT3_16 */
#define PWM1_A2_PIO3_16 N9X_MUX('3',16,5) /* PT3_16 */
#define FLEXIO0_D24_PIO3_16 N9X_MUX('3',16,6) /* PT3_16 */
#define SMARTDMA_PIO16_PIO3_16 N9X_MUX('3',16,7) /* PT3_16 */
#define SIM0_CLK_PIO3_16 N9X_MUX('3',16,9) /* PT3_16 */
#define SAI1_TX_BCLK_PIO3_16 N9X_MUX('3',16,10) /* PT3_16 */
#define PIO3_17 N9X_MUX('3',17,0) /* PT3_17 */
#define WUU0_IN26_PIO3_17 N9X_MUX('3',17,0) /* PT3_17 */
#define FC8_P3_PIO3_17 N9X_MUX('3',17,2) /* PT3_17 */
#define CT_INP9_PIO3_17 N9X_MUX('3',17,4) /* PT3_17 */
#define PWM1_B2_PIO3_17 N9X_MUX('3',17,5) /* PT3_17 */
#define FLEXIO0_D25_PIO3_17 N9X_MUX('3',17,6) /* PT3_17 */
#define SMARTDMA_PIO17_PIO3_17 N9X_MUX('3',17,7) /* PT3_17 */
#define SIM0_IO_PIO3_17 N9X_MUX('3',17,9) /* PT3_17 */
#define SAI1_TX_FS_PIO3_17 N9X_MUX('3',17,10) /* PT3_17 */
#define PIO3_18 N9X_MUX('3',18,0) /* PT3_18 */
#define FC6_P6_PIO3_18 N9X_MUX('3',18,3) /* PT3_18 */
#define CT2_MAT0_PIO3_18 N9X_MUX('3',18,4) /* PT3_18 */
#define PWM1_X0_PIO3_18 N9X_MUX('3',18,5) /* PT3_18 */
#define FLEXIO0_D26_PIO3_18 N9X_MUX('3',18,6) /* PT3_18 */
#define SMARTDMA_PIO18_PIO3_18 N9X_MUX('3',18,7) /* PT3_18 */
#define SAI1_RX_BCLK_PIO3_18 N9X_MUX('3',18,10) /* PT3_18 */
#define PIO3_19 N9X_MUX('3',19,0) /* PT3_19 */
#define FC7_P6_PIO3_19 N9X_MUX('3',19,2) /* PT3_19 */
#define CT2_MAT1_PIO3_19 N9X_MUX('3',19,4) /* PT3_19 */
#define PWM1_X1_PIO3_19 N9X_MUX('3',19,5) /* PT3_19 */
#define FLEXIO0_D27_PIO3_19 N9X_MUX('3',19,6) /* PT3_19 */
#define SMARTDMA_PIO19_PIO3_19 N9X_MUX('3',19,7) /* PT3_19 */
#define SAI1_RX_FS_PIO3_19 N9X_MUX('3',19,10) /* PT3_19 */
#define WUU0_IN27_PIO3_20 N9X_MUX('3',20,0) /* PT3_20 */
#define PIO3_20 N9X_MUX('3',20,0) /* PT3_20 */
#define TRIG_OUT0_PIO3_20 N9X_MUX('3',20,1) /* PT3_20 */
#define FC8_P4_PIO3_20 N9X_MUX('3',20,2) /* PT3_20 */
#define FC6_P0_PIO3_20 N9X_MUX('3',20,3) /* PT3_20 */
#define CT2_MAT2_PIO3_20 N9X_MUX('3',20,4) /* PT3_20 */
#define PWM1_A3_PIO3_20 N9X_MUX('3',20,5) /* PT3_20 */
#define FLEXIO0_D28_PIO3_20 N9X_MUX('3',20,6) /* PT3_20 */
#define SMARTDMA_PIO20_PIO3_20 N9X_MUX('3',20,7) /* PT3_20 */
#define SIM0_PD_PIO3_20 N9X_MUX('3',20,9) /* PT3_20 */
#define SAI1_TXD0_PIO3_20 N9X_MUX('3',20,10) /* PT3_20 */
#define PF_SPI_CS0_DIS_n_PIO3_20 N9X_MUX('3',20,11) /* PT3_20 */
#define PIO3_21 N9X_MUX('3',21,0) /* PT3_21 */
#define TRIG_OUT1_PIO3_21 N9X_MUX('3',21,1) /* PT3_21 */
#define FC8_P5_PIO3_21 N9X_MUX('3',21,2) /* PT3_21 */
#define FC6_P1_PIO3_21 N9X_MUX('3',21,3) /* PT3_21 */
#define CT2_MAT3_PIO3_21 N9X_MUX('3',21,4) /* PT3_21 */
#define PWM1_B3_PIO3_21 N9X_MUX('3',21,5) /* PT3_21 */
#define FLEXIO0_D29_PIO3_21 N9X_MUX('3',21,6) /* PT3_21 */
#define SMARTDMA_PIO21_PIO3_21 N9X_MUX('3',21,7) /* PT3_21 */
#define SIM0_RST_PIO3_21 N9X_MUX('3',21,9) /* PT3_21 */
#define SAI1_RXD0_PIO3_21 N9X_MUX('3',21,10) /* PT3_21 */
#define PF_SPI_CS1_DIS_n_PIO3_21 N9X_MUX('3',21,11) /* PT3_21 */
#define PIO3_22 N9X_MUX('3',22,0) /* PT3_22 */
#define FC8_P6_PIO3_22 N9X_MUX('3',22,2) /* PT3_22 */
#define FC6_P2_PIO3_22 N9X_MUX('3',22,3) /* PT3_22 */
#define CT_INP10_PIO3_22 N9X_MUX('3',22,4) /* PT3_22 */
#define PWM1_X2_PIO3_22 N9X_MUX('3',22,5) /* PT3_22 */
#define FLEXIO0_D30_PIO3_22 N9X_MUX('3',22,6) /* PT3_22 */
#define SMARTDMA_PIO22_PIO3_22 N9X_MUX('3',22,7) /* PT3_22 */
#define SIM0_VCCEN_PIO3_22 N9X_MUX('3',22,9) /* PT3_22 */
#define SAI1_RXD1_PIO3_22 N9X_MUX('3',22,10) /* PT3_22 */
#define PIO3_23 N9X_MUX('3',23,0) /* PT3_23 */
#define FC6_P3_PIO3_23 N9X_MUX('3',23,3) /* PT3_23 */
#define CT_INP11_PIO3_23 N9X_MUX('3',23,4) /* PT3_23 */
#define PWM1_X3_PIO3_23 N9X_MUX('3',23,5) /* PT3_23 */
#define FLEXIO0_D31_PIO3_23 N9X_MUX('3',23,6) /* PT3_23 */
#define SMARTDMA_PIO23_PIO3_23 N9X_MUX('3',23,7) /* PT3_23 */
#define SAI1_TXD1_PIO3_23 N9X_MUX('3',23,10) /* PT3_23 */
#define PIO4_0 N9X_MUX('4',0,0) /* PT4_0 */
#define WUU0_IN18_PIO4_0 N9X_MUX('4',0,0) /* PT4_0 */
#define TRIG_IN6_PIO4_0 N9X_MUX('4',0,1) /* PT4_0 */
#define FC2_P0_PIO4_0 N9X_MUX('4',0,2) /* PT4_0 */
#define CT_INP16_PIO4_0 N9X_MUX('4',0,4) /* PT4_0 */
#define SMARTDMA_PIO24_PIO4_0 N9X_MUX('4',0,7) /* PT4_0 */
#define PLU_IN0_PIO4_0 N9X_MUX('4',0,8) /* PT4_0 */
#define SINC0_MCLK3_PIO4_0 N9X_MUX('4',0,9) /* PT4_0 */
#define PIO4_1 N9X_MUX('4',1,0) /* PT4_1 */
#define TRIG_IN7_PIO4_1 N9X_MUX('4',1,1) /* PT4_1 */
#define FC2_P1_PIO4_1 N9X_MUX('4',1,2) /* PT4_1 */
#define CT_INP17_PIO4_1 N9X_MUX('4',1,4) /* PT4_1 */
#define SMARTDMA_PIO25_PIO4_1 N9X_MUX('4',1,7) /* PT4_1 */
