zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxn/pinctrl/MCXN947VDF-pinctrl.h
#define PLU_IN1_PIO4_1 N9X_MUX('4',1,8) /* PT4_1 */
#define DAC0_OUT_PIO4_2 N9X_MUX('4',2,0) /* PT4_2 */
#define CMP1_IN4N_PIO4_2 N9X_MUX('4',2,0) /* PT4_2 */
#define ADC1_A4_PIO4_2 N9X_MUX('4',2,0) /* PT4_2 */
#define CMP0_IN4N_PIO4_2 N9X_MUX('4',2,0) /* PT4_2 */
#define CMP2_IN4N_PIO4_2 N9X_MUX('4',2,0) /* PT4_2 */
#define ADC0_A4_PIO4_2 N9X_MUX('4',2,0) /* PT4_2 */
#define PIO4_2 N9X_MUX('4',2,0) /* PT4_2 */
#define TRIG_IN6_PIO4_2 N9X_MUX('4',2,1) /* PT4_2 */
#define FC2_P2_PIO4_2 N9X_MUX('4',2,2) /* PT4_2 */
#define CT_INP12_PIO4_2 N9X_MUX('4',2,4) /* PT4_2 */
#define SMARTDMA_PIO26_PIO4_2 N9X_MUX('4',2,7) /* PT4_2 */
#define PLU_IN2_PIO4_2 N9X_MUX('4',2,8) /* PT4_2 */
#define SINC0_MBIT3_PIO4_2 N9X_MUX('4',2,9) /* PT4_2 */
#define PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define DAC1_OUT_PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define ADC0_B4_PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define CMP1_IN5N_PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define CMP2_IN5N_PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define CMP0_IN5N_PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define WUU0_IN19_PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define ADC1_B4_PIO4_3 N9X_MUX('4',3,0) /* PT4_3 */
#define TRIG_IN7_PIO4_3 N9X_MUX('4',3,1) /* PT4_3 */
#define FC2_P3_PIO4_3 N9X_MUX('4',3,2) /* PT4_3 */
#define CT_INP13_PIO4_3 N9X_MUX('4',3,4) /* PT4_3 */
#define SMARTDMA_PIO27_PIO4_3 N9X_MUX('4',3,7) /* PT4_3 */
#define PLU_IN3_PIO4_3 N9X_MUX('4',3,8) /* PT4_3 */
#define PIO4_4 N9X_MUX('4',4,0) /* PT4_4 */
#define FC2_P4_PIO4_4 N9X_MUX('4',4,2) /* PT4_4 */
#define CT_INP14_PIO4_4 N9X_MUX('4',4,4) /* PT4_4 */
#define SMARTDMA_PIO28_PIO4_4 N9X_MUX('4',4,7) /* PT4_4 */
#define PLU_IN4_PIO4_4 N9X_MUX('4',4,8) /* PT4_4 */
#define SINC0_MCLK4_PIO4_4 N9X_MUX('4',4,9) /* PT4_4 */
#define PIO4_5 N9X_MUX('4',5,0) /* PT4_5 */
#define FC2_P5_PIO4_5 N9X_MUX('4',5,2) /* PT4_5 */
#define CT_INP15_PIO4_5 N9X_MUX('4',5,4) /* PT4_5 */
#define SMARTDMA_PIO29_PIO4_5 N9X_MUX('4',5,7) /* PT4_5 */
#define PLU_IN5_PIO4_5 N9X_MUX('4',5,8) /* PT4_5 */
#define SINC0_MBIT4_PIO4_5 N9X_MUX('4',5,9) /* PT4_5 */
#define PIO4_6 N9X_MUX('4',6,0) /* PT4_6 */
#define TRIG_OUT4_PIO4_6 N9X_MUX('4',6,1) /* PT4_6 */
#define FC2_P6_PIO4_6 N9X_MUX('4',6,2) /* PT4_6 */
#define CT_INP18_PIO4_6 N9X_MUX('4',6,4) /* PT4_6 */
#define SMARTDMA_PIO30_PIO4_6 N9X_MUX('4',6,7) /* PT4_6 */
#define PLU_CLK_PIO4_6 N9X_MUX('4',6,8) /* PT4_6 */
#define PIO4_7 N9X_MUX('4',7,0) /* PT4_7 */
#define CT_INP19_PIO4_7 N9X_MUX('4',7,4) /* PT4_7 */
#define SMARTDMA_PIO31_PIO4_7 N9X_MUX('4',7,7) /* PT4_7 */
#define PIO4_12 N9X_MUX('4',12,0) /* PT4_12 */
#define OPAMP0_INP0_PIO4_12 N9X_MUX('4',12,0) /* PT4_12 */
#define ADC1_A5_PIO4_12 N9X_MUX('4',12,0) /* PT4_12 */
#define ADC0_A5_PIO4_12 N9X_MUX('4',12,0) /* PT4_12 */
#define WUU0_IN20_PIO4_12 N9X_MUX('4',12,0) /* PT4_12 */
#define USB0_VBUS_DET_PIO4_12 N9X_MUX('4',12,1) /* PT4_12 */
#define FC2_P0_PIO4_12 N9X_MUX('4',12,2) /* PT4_12 */
#define CT4_MAT0_PIO4_12 N9X_MUX('4',12,4) /* PT4_12 */
#define FLEXIO0_D20_PIO4_12 N9X_MUX('4',12,6) /* PT4_12 */
#define PLU_OUT0_PIO4_12 N9X_MUX('4',12,8) /* PT4_12 */
#define SINC0_MCLK0_PIO4_12 N9X_MUX('4',12,9) /* PT4_12 */
#define CAN0_RXD_PIO4_12 N9X_MUX('4',12,11) /* PT4_12 */
#define PIO4_13 N9X_MUX('4',13,0) /* PT4_13 */
#define ADC0_B5_PIO4_13 N9X_MUX('4',13,0) /* PT4_13 */
#define ADC1_B5_PIO4_13 N9X_MUX('4',13,0) /* PT4_13 */
#define OPAMP0_INP1_PIO4_13 N9X_MUX('4',13,0) /* PT4_13 */
#define TRIG_IN8_PIO4_13 N9X_MUX('4',13,1) /* PT4_13 */
#define FC2_P1_PIO4_13 N9X_MUX('4',13,2) /* PT4_13 */
#define USB1_ID_PIO4_13 N9X_MUX('4',13,3) /* PT4_13 */
#define CT4_MAT1_PIO4_13 N9X_MUX('4',13,4) /* PT4_13 */
#define FLEXIO0_D21_PIO4_13 N9X_MUX('4',13,6) /* PT4_13 */
#define PLU_OUT1_PIO4_13 N9X_MUX('4',13,8) /* PT4_13 */
#define SINC0_MBIT0_PIO4_13 N9X_MUX('4',13,9) /* PT4_13 */
#define CAN0_TXD_PIO4_13 N9X_MUX('4',13,11) /* PT4_13 */
#define PIO4_14 N9X_MUX('4',14,0) /* PT4_14 */
#define CT4_MAT2_PIO4_14 N9X_MUX('4',14,4) /* PT4_14 */
#define FLEXIO0_D22_PIO4_14 N9X_MUX('4',14,6) /* PT4_14 */
#define PLU_OUT2_PIO4_14 N9X_MUX('4',14,8) /* PT4_14 */
#define OPAMP0_OUT_PIO4_15 N9X_MUX('4',15,0) /* PT4_15 */
#define ADC0_A1_PIO4_15 N9X_MUX('4',15,0) /* PT4_15 */
#define WUU0_IN21_PIO4_15 N9X_MUX('4',15,0) /* PT4_15 */
#define PIO4_15 N9X_MUX('4',15,0) /* PT4_15 */
#define CMP0_IN4P_PIO4_15 N9X_MUX('4',15,0) /* PT4_15 */
#define TRIG_OUT4_PIO4_15 N9X_MUX('4',15,1) /* PT4_15 */
#define USB1_VBUS_DIG_PIO4_15 N9X_MUX('4',15,3) /* PT4_15 */
#define CT4_MAT3_PIO4_15 N9X_MUX('4',15,4) /* PT4_15 */
#define FLEXIO0_D23_PIO4_15 N9X_MUX('4',15,6) /* PT4_15 */
#define PLU_OUT3_PIO4_15 N9X_MUX('4',15,8) /* PT4_15 */
#define SINC0_MCLK_OUT0_PIO4_15 N9X_MUX('4',15,9) /* PT4_15 */
#define CAN1_RXD_PIO4_15 N9X_MUX('4',15,11) /* PT4_15 */
#define ADC0_A6_PIO4_16 N9X_MUX('4',16,0) /* PT4_16 */
#define OPAMP1_INP0_PIO4_16 N9X_MUX('4',16,0) /* PT4_16 */
#define PIO4_16 N9X_MUX('4',16,0) /* PT4_16 */
#define FC2_P2_PIO4_16 N9X_MUX('4',16,2) /* PT4_16 */
#define USB1_OTG_PWR_PIO4_16 N9X_MUX('4',16,3) /* PT4_16 */
#define CT3_MAT0_PIO4_16 N9X_MUX('4',16,4) /* PT4_16 */
#define FLEXIO0_D24_PIO4_16 N9X_MUX('4',16,6) /* PT4_16 */
#define PLU_OUT4_PIO4_16 N9X_MUX('4',16,8) /* PT4_16 */
#define SINC0_MCLK1_PIO4_16 N9X_MUX('4',16,9) /* PT4_16 */
#define CAN1_TXD_PIO4_16 N9X_MUX('4',16,11) /* PT4_16 */
#define ADC0_B6_PIO4_17 N9X_MUX('4',17,0) /* PT4_17 */
#define PIO4_17 N9X_MUX('4',17,0) /* PT4_17 */
#define OPAMP1_INP1_PIO4_17 N9X_MUX('4',17,0) /* PT4_17 */
#define TRIG_IN9_PIO4_17 N9X_MUX('4',17,1) /* PT4_17 */
#define FC2_P3_PIO4_17 N9X_MUX('4',17,2) /* PT4_17 */
#define USB1_OTG_OC_PIO4_17 N9X_MUX('4',17,3) /* PT4_17 */
#define CT3_MAT1_PIO4_17 N9X_MUX('4',17,4) /* PT4_17 */
#define FLEXIO0_D25_PIO4_17 N9X_MUX('4',17,6) /* PT4_17 */
#define PLU_OUT5_PIO4_17 N9X_MUX('4',17,8) /* PT4_17 */
#define SINC0_MBIT1_PIO4_17 N9X_MUX('4',17,9) /* PT4_17 */
#define PIO4_18 N9X_MUX('4',18,0) /* PT4_18 */
#define CT3_MAT2_PIO4_18 N9X_MUX('4',18,4) /* PT4_18 */
#define FLEXIO0_D26_PIO4_18 N9X_MUX('4',18,6) /* PT4_18 */
#define PLU_OUT6_PIO4_18 N9X_MUX('4',18,8) /* PT4_18 */
#define ADC0_B1_PIO4_19 N9X_MUX('4',19,0) /* PT4_19 */
#define PIO4_19 N9X_MUX('4',19,0) /* PT4_19 */
#define CMP1_IN4P_PIO4_19 N9X_MUX('4',19,0) /* PT4_19 */
#define OPAMP1_OUT_PIO4_19 N9X_MUX('4',19,0) /* PT4_19 */
#define TRIG_OUT5_PIO4_19 N9X_MUX('4',19,1) /* PT4_19 */
#define CT3_MAT3_PIO4_19 N9X_MUX('4',19,4) /* PT4_19 */
#define FLEXIO0_D27_PIO4_19 N9X_MUX('4',19,6) /* PT4_19 */
#define PLU_OUT7_PIO4_19 N9X_MUX('4',19,8) /* PT4_19 */
#define SINC0_MCLK_OUT1_PIO4_19 N9X_MUX('4',19,9) /* PT4_19 */
#define PIO4_20 N9X_MUX('4',20,0) /* PT4_20 */
#define ADC1_A6_PIO4_20 N9X_MUX('4',20,0) /* PT4_20 */
#define OPAMP2_INP0_PIO4_20 N9X_MUX('4',20,0) /* PT4_20 */
#define TRIG_IN8_PIO4_20 N9X_MUX('4',20,1) /* PT4_20 */
#define FC2_P4_PIO4_20 N9X_MUX('4',20,2) /* PT4_20 */
#define CT2_MAT0_PIO4_20 N9X_MUX('4',20,4) /* PT4_20 */
#define FLEXIO0_D28_PIO4_20 N9X_MUX('4',20,6) /* PT4_20 */
#define SINC0_MCLK2_PIO4_20 N9X_MUX('4',20,9) /* PT4_20 */
#define ADC1_B6_PIO4_21 N9X_MUX('4',21,0) /* PT4_21 */
#define OPAMP2_INP1_PIO4_21 N9X_MUX('4',21,0) /* PT4_21 */
#define PIO4_21 N9X_MUX('4',21,0) /* PT4_21 */
#define TRIG_IN9_PIO4_21 N9X_MUX('4',21,1) /* PT4_21 */
#define FC2_P5_PIO4_21 N9X_MUX('4',21,2) /* PT4_21 */
#define CT2_MAT1_PIO4_21 N9X_MUX('4',21,4) /* PT4_21 */
#define FLEXIO0_D29_PIO4_21 N9X_MUX('4',21,6) /* PT4_21 */
#define SINC0_MBIT2_PIO4_21 N9X_MUX('4',21,9) /* PT4_21 */
#define PIO4_22 N9X_MUX('4',22,0) /* PT4_22 */
#define CT2_MAT2_PIO4_22 N9X_MUX('4',22,4) /* PT4_22 */
#define FLEXIO0_D30_PIO4_22 N9X_MUX('4',22,6) /* PT4_22 */
#define ADC0_B2_PIO4_23 N9X_MUX('4',23,0) /* PT4_23 */
#define OPAMP2_OUT_PIO4_23 N9X_MUX('4',23,0) /* PT4_23 */
#define PIO4_23 N9X_MUX('4',23,0) /* PT4_23 */
#define ADC0_A2_PIO4_23 N9X_MUX('4',23,0) /* PT4_23 */
#define ADC1_B3_PIO4_23 N9X_MUX('4',23,0) /* PT4_23 */
#define CMP2_IN4P_PIO4_23 N9X_MUX('4',23,0) /* PT4_23 */
#define TRIG_OUT5_PIO4_23 N9X_MUX('4',23,1) /* PT4_23 */
#define FC2_P6_PIO4_23 N9X_MUX('4',23,2) /* PT4_23 */
#define CT2_MAT3_PIO4_23 N9X_MUX('4',23,4) /* PT4_23 */
#define FLEXIO0_D31_PIO4_23 N9X_MUX('4',23,6) /* PT4_23 */
#define SINC0_MCLK_OUT2_PIO4_23 N9X_MUX('4',23,9) /* PT4_23 */
#define EXTAL32K_PIO5_0 N9X_MUX('5',0,0) /* PT5_0 */
#define PIO5_0 N9X_MUX('5',0,0) /* PT5_0 */
#define ADC1_B8_PIO5_0 N9X_MUX('5',0,0) /* PT5_0 */
#define TRIG_IN10_PIO5_0 N9X_MUX('5',0,1) /* PT5_0 */
#define LPTMR0_ALT2_PIO5_0 N9X_MUX('5',0,2) /* PT5_0 */
#define PIO5_1 N9X_MUX('5',1,0) /* PT5_1 */
#define XTAL32K_PIO5_1 N9X_MUX('5',1,0) /* PT5_1 */
#define ADC1_B9_PIO5_1 N9X_MUX('5',1,0) /* PT5_1 */
#define TRIG_OUT6_PIO5_1 N9X_MUX('5',1,1) /* PT5_1 */
#define LPTMR1_ALT2_PIO5_1 N9X_MUX('5',1,2) /* PT5_1 */
#define PIO5_2 N9X_MUX('5',2,0) /* PT5_2 */
#define ADC1_B10_PIO5_2 N9X_MUX('5',2,0) /* PT5_2 */
#define VBAT_WAKEUP_b_PIO5_2 N9X_MUX('5',2,1) /* PT5_2 */
#define SPC_LPREQ_PIO5_2 N9X_MUX('5',2,2) /* PT5_2 */
#define TAMPER0_PIO5_2 N9X_MUX('5',2,3) /* PT5_2 */
#define PIO5_3 N9X_MUX('5',3,0) /* PT5_3 */
#define ADC1_B11_PIO5_3 N9X_MUX('5',3,0) /* PT5_3 */
#define TRIG_IN11_PIO5_3 N9X_MUX('5',3,1) /* PT5_3 */
#define RTC_CLKOUT_PIO5_3 N9X_MUX('5',3,2) /* PT5_3 */
#define TAMPER1_PIO5_3 N9X_MUX('5',3,3) /* PT5_3 */
#define PIO5_4 N9X_MUX('5',4,0) /* PT5_4 */
#define ADC1_B12_PIO5_4 N9X_MUX('5',4,0) /* PT5_4 */
#define TRIG_OUT7_PIO5_4 N9X_MUX('5',4,1) /* PT5_4 */
#define SPC_LPREQ_PIO5_4 N9X_MUX('5',4,2) /* PT5_4 */
#define TAMPER2_PIO5_4 N9X_MUX('5',4,3) /* PT5_4 */
#define ADC1_B13_PIO5_5 N9X_MUX('5',5,0) /* PT5_5 */
#define PIO5_5 N9X_MUX('5',5,0) /* PT5_5 */
#define TRIG_IN10_PIO5_5 N9X_MUX('5',5,1) /* PT5_5 */
#define LPTMR0_ALT2_PIO5_5 N9X_MUX('5',5,2) /* PT5_5 */
#define TAMPER3_PIO5_5 N9X_MUX('5',5,3) /* PT5_5 */
#define ADC1_B14_PIO5_6 N9X_MUX('5',6,0) /* PT5_6 */
#define PIO5_6 N9X_MUX('5',6,0) /* PT5_6 */
#define TRIG_OUT6_PIO5_6 N9X_MUX('5',6,1) /* PT5_6 */
#define LPTMR1_ALT2_PIO5_6 N9X_MUX('5',6,2) /* PT5_6 */
#define TAMPER4_PIO5_6 N9X_MUX('5',6,3) /* PT5_6 */
#define PIO5_7 N9X_MUX('5',7,0) /* PT5_7 */
#define ADC1_B15_PIO5_7 N9X_MUX('5',7,0) /* PT5_7 */
#define TRIG_IN11_PIO5_7 N9X_MUX('5',7,1) /* PT5_7 */
#define TAMPER5_PIO5_7 N9X_MUX('5',7,3) /* PT5_7 */
#define ADC1_B16_PIO5_8 N9X_MUX('5',8,0) /* PT5_8 */
#define PIO5_8 N9X_MUX('5',8,0) /* PT5_8 */
#define TRIG_OUT7_PIO5_8 N9X_MUX('5',8,1) /* PT5_8 */
#define TAMPER6_PIO5_8 N9X_MUX('5',8,3) /* PT5_8 */
#define ADC1_B17_PIO5_9 N9X_MUX('5',9,0) /* PT5_9 */
#define PIO5_9 N9X_MUX('5',9,0) /* PT5_9 */
#define TAMPER7_PIO5_9 N9X_MUX('5',9,3) /* PT5_9 */
#endif
